devbis/zephyr-tlsr8258/drivers/ieee802154/ieee802154_tlsr8258.c
/*
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT telink_tlsr8258_zb

#include <errno.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>

#include <zephyr/device.h>
#include <zephyr/drivers/ieee802154/tlsr8258_zigbee_bridge.h>
#include <zephyr/irq.h>
#include <zephyr/kernel.h>
#include <zephyr/linker/section_tags.h>
#include <zephyr/logging/log.h>
#include <zephyr/net/ieee802154.h>
#include <zephyr/net/ieee802154_frame.h>
#include <zephyr/net/ieee802154_pkt.h>
#include <zephyr/net/ieee802154_radio.h>
#include <zephyr/net/net_if.h>
#include <zephyr/net/net_pkt.h>
#include <zephyr/random/random.h>
#include <zephyr/sys/byteorder.h>
#include <zephyr/sys/util.h>
#include <zephyr/zigbee/zb_bootstrap.h>
#include <tlsr825x/irq.h>
#include <tlsr825x/power.h>

#include "ieee802154_tlsr8258_tx_irq.h"
#include "ieee802154_tlsr8258_radio_op.h"
#include "ieee802154_tlsr8258_rf_irq.h"
#include "ieee802154_tlsr8258_rx_queue.h"
#include "ieee802154_tlsr8258_ack_filter.h"
#include "ieee802154_tlsr8258_fake_phy_core.h"

LOG_MODULE_REGISTER(ieee802154_tlsr8258, CONFIG_IEEE802154_DRIVER_LOG_LEVEL);

#define TLSR_REG8(addr)  (*(volatile uint8_t *)(0x00800000u + (addr)))
#define TLSR_REG16(addr) (*(volatile uint16_t *)(0x00800000u + (addr)))
#define TLSR_REG32(addr) (*(volatile uint32_t *)(0x00800000u + (addr)))

#define TCMD_UNDER_WR 0x80u
#define TCMD_MASK     0x3fu
#define TCMD_WRITE    0x03u

/*
 * TLSR825x hardware watchdog (timer2-based), per
 * ../tl_zigbee_sdk/platform/chip_8258/watchdog.h and register.h
 * (reg_tmr_ctrl=0x620, reg_tmr_sta=0x623, reg_tmr2_tick=0x638;
 * FLD_TMR2_EN=BIT6, FLD_TMR_WD_CAPT=BIT_RNG(9,22), FLD_TMR_WD_EN=BIT23,
 * FLD_TMR_STA_WD=BIT3). This project has repeatedly hit ZB-thread hangs
 * that are plain infinite loops or a stuck hardware bus access rather than
 * a CPU fault/exception -- k_sys_fatal_error_handler() never runs for
 * those, so it cannot self-heal them. Feeding this watchdog once per
 * zb_thread main-loop pass converts ANY such hang (root cause found or
 * not) into a hardware-forced reboot instead of a permanent silent death;
 * the existing boot-time bootstrap (zb_core_bootstrap_once() / zdo_init())
 * already knows how to resume a retained-joined ED/router after a reset.
 */
#define TLSR_REG_TMR_CTRL   0x0620u
#define TLSR_REG_TMR_STA    0x0623u
#define TLSR_REG_TMR2_TICK  0x0638u
#define TLSR_FLD_TMR2_EN     BIT(6)
#define TLSR_FLD_TMR_WD_EN   BIT(23)
#define TLSR_FLD_TMR_STA_WD  BIT(3)

/* system_clk_mHz for TLSR825x is fixed at 16 (CONFIG_SYS_CLOCK_HW_CYCLES_PER_SEC
 * = 16000000). period_ms*1000*16 >> 18, then placed at bits[9:22] (14 bits,
 * max ~16.7s). Use a generous window: long enough that no legitimate
 * blocking operation in the loop (flash NV writes, etc.) ever comes close,
 * short enough to recover promptly from a real hang. */
#define TLSR_WATCHDOG_PERIOD_MS 8000u

/*
 * A watchdog-triggered reset on this SoC does not clear the watchdog's own
 * enable bit or its running tick -- the same peripheral-state retention this
 * project has already documented for SRAM across a soft reset. Left armed,
 * the just-fired watchdog immediately resumes counting from a stale tick
 * value close to (or past) the period threshold, re-firing again within a
 * fraction of the configured period on the very next boot -- a crash loop
 * that never gets far enough into bootstrap to reach tlsr8258_watchdog_init()
 * below. Call this as the very first thing at boot, before anything else,
 * to guarantee a clean slate; tlsr8258_watchdog_init() re-arms it once
 * bootstrap actually completes.
 */
void tlsr8258_watchdog_disable(void)
{
	TLSR_REG32(TLSR_REG_TMR_CTRL) &= ~(TLSR_FLD_TMR2_EN | TLSR_FLD_TMR_WD_EN);
	TLSR_REG32(TLSR_REG_TMR2_TICK) = 0u;
	TLSR_REG8(TLSR_REG_TMR_STA) = (uint8_t)TLSR_FLD_TMR_STA_WD;
}

void tlsr8258_watchdog_init(void)
{
	uint32_t period_field = ((uint64_t)TLSR_WATCHDOG_PERIOD_MS * 1000u * 16u) >> 18;
	uint32_t ctrl;

	tlsr8258_watchdog_disable();

	ctrl = TLSR_REG32(TLSR_REG_TMR_CTRL);
	ctrl &= ~(0x3fffu << 9);
	ctrl |= (period_field & 0x3fffu) << 9;
	TLSR_REG32(TLSR_REG_TMR_CTRL) = ctrl;
	TLSR_REG32(TLSR_REG_TMR2_TICK) = 0u;
	TLSR_REG32(TLSR_REG_TMR_CTRL) |= TLSR_FLD_TMR2_EN | TLSR_FLD_TMR_WD_EN;
}

void tlsr8258_watchdog_feed(void)
{
	/*
	 * Re-assert the enable bits on every feed, not just at init. Confirmed
	 * on hardware: reg_tmr_ctrl's TMR2_EN/WD_EN bits were found cleared
	 * (whole register read back as 0) partway through a normal run that
	 * had clearly gotten past tlsr8258_watchdog_init() (hundreds of loop
	 * passes in) -- nothing else in this codebase writes reg_tmr_ctrl, so
	 * treat however that happens as unexplained and just make every feed
	 * self-healing instead of a bare status-clear that silently does
	 * nothing once disarmed. Setting already-set bits is a no-op.
	 */
	TLSR_REG32(TLSR_REG_TMR_CTRL) |= TLSR_FLD_TMR2_EN | TLSR_FLD_TMR_WD_EN;
	TLSR_REG8(TLSR_REG_TMR_STA) = (uint8_t)TLSR_FLD_TMR_STA_WD;
}

#define RF_TRX_MODE 0xe0u
#define RF_TRX_OFF  0x45u

#define RF_IRQ_RX          BIT(0)
#define RF_IRQ_TX          BIT(1)
#define RF_IRQ_RX_TIMEOUT  BIT(2)
#define RF_IRQ_RX_CRC_2    BIT(4)
#define RF_IRQ_CMD_DONE    BIT(5)
#define RF_IRQ_FSM_TIMEOUT BIT(6)
#define RF_IRQ_RX_EVENTS   (RF_IRQ_RX | RF_IRQ_RX_CRC_2 | RF_IRQ_RX_DR)
#define RF_IRQ_RX_DR       BIT(9)
#define RF_IRQ_TX_DS       BIT(8)
#define RF_IRQ_STX_TIMEOUT BIT(12)
#define RF_IRQ_ALL         0xffffu

#define DMA_CHN_RF_RX BIT(2)
#define DMA_CHN_RF_TX BIT(3)

#define TLSR8258_RX_BUF_SIZE 144u
#define TLSR8258_RX_DMA_SIZE 144u
#define TLSR8258_TX_BUF_SIZE 132u
#define TLSR8258_PAYLOAD_OFFSET 5u
#define TLSR8258_PHY_MAX_PSDU 127u
#define TLSR8258_FCS_LENGTH 2u
#define TLSR8258_MIN_FRAME_LENGTH 3u
/*
 * Total prep budget between the fast-path set_txmode_for_ack call and the
 * tx_pkt write for a MAC ACK.  Capture analysis:
 *   - 150us TURNAROUND landed ACK ~80us after end-of-coord-PSDU (the lower
 *     end of the 802.15.4 spec window; on the one run where this worked,
 *     coord accepted and TK was delivered).
 *   - 350us TURNAROUND pushed ACK to ~1.3ms after end-of-coord-PSDU, which
 *     exceeds macAckWaitDuration (864us).  Coord dropped that ACK, exhausted
 *     macMaxFrameRetries, and refused to queue Transport-Key.
 * Stick with 150us — better to be slightly early than too late.  We use the
 * fast-path set_txmode_for_ack (no PLL reload) to keep total latency tight.
 *
 * 2026-08: zigbee-rs anchors this settle window at RX completion, before
 * clearing the RX event and parsing the frame.  The TX-mode switch and
 * address/pending lookup happen inside that window; waiting a fresh 120us
 * after the ISR enters TX makes the ACK miss macAckWaitDuration.
 */
#define TLSR8258_ACK_TURNAROUND_US 120u
/*
 * TC32 has no hardware divider, so converting (k_cycle_get_32() - start) to
 * microseconds inside the ACK hot path costs ~3-6us per call via the
 * software 32-bit divide emitted by k_cyc_to_us_floor32(). Pre-multiply the
 * turnaround once at compile time and compare in the cycle domain instead.
 */
#define TLSR8258_ACK_TURNAROUND_CYC \
	((uint32_t)TLSR8258_ACK_TURNAROUND_US * \
	 (CONFIG_SYS_CLOCK_HW_CYCLES_PER_SEC / 1000000u))
#define TLSR8258_ACK_REQUEST BIT(5)
#define TLSR8258_FRAME_PENDING BIT(4)
#define TLSR8258_IEEE_ADDR_SIZE 8u
#define TLSR8258_SHORT_ADDR_SIZE 2u
#define TLSR8258_PAN_ID_SIZE 2u
#define TLSR8258_FRAME_TYPE_OFFSET 0u
#define TLSR8258_DEST_ADDR_TYPE_OFFSET 1u
#define TLSR8258_DEST_ADDR_TYPE_MASK 0x0cu
#define TLSR8258_DEST_ADDR_TYPE_SHORT 0x08u
#define TLSR8258_DEST_ADDR_TYPE_IEEE 0x0cu
#define TLSR8258_PAN_ID_OFFSET 3u
#define TLSR8258_DEST_ADDR_OFFSET 5u
#define TLSR8258_RSSI_TO_LQI_MIN -87
#define TLSR8258_RSSI_TO_LQI_SCALE 3
#define TLSR8258_RX_SLOT_COUNT 16u

struct tblcmdset {
	uint16_t adr;
	uint8_t dat;
	uint8_t cmd;
};

struct tlsr8258_radio_config {
	void (*irq_config_func)(const struct device *dev);
};

struct tlsr8258_radio_debug {
	volatile uint32_t rf_isr_entry_count;
	volatile uint32_t rf_isr_rx_event_count;
	volatile uint32_t rx_capture_debug_count;
	volatile uint16_t rf_irq_raw_debug;
	volatile uint16_t rf_irq_effective_debug;
	volatile uint16_t rf_irq_mask_debug;
	volatile uint16_t rf_irq_ack_debug;
	volatile uint16_t rx_capture_irq_debug;
	volatile uint8_t rf_dma_len_debug;
	volatile uint8_t rf_psdu_len_debug;
	volatile uint8_t rf_crc_debug;
	volatile uint8_t rf_branch_debug;
	volatile uint32_t tx_diag_trace[32];
	volatile uint8_t tx_diag_trace_head;
	/*
	 * Snapshot of RF chip control registers taken at the start of every
	 * RX ISR.  Lets us inspect what state the chip is actually in without
	 * having to halt via SWS — read these via debugger / TlsrPgm dump.
	 *  reg_0f00: reg_rf_ll_cmd       (state machine command)
	 *  reg_0f02: reg_rf_ll_ctrl_0    (TRX state: OFF/TX/RX bits)
	 *  reg_0f03: reg_rf_ll_ctrl_1    (FSM timeout / CRC enables)
	 *  reg_0f15: reg_rf_ll_ctrl_2    (pipe / mode select)
	 *  reg_0f16: reg_rf_ll_ctrl_3    (auto-FSM mode bits, our LL_MODE_*)
	 *  reg_0428: TX/RX gate register
	 *  reg_0430: another RF control register
	 */
	volatile uint8_t rf_reg_0f00;
	volatile uint8_t rf_reg_0f02;
	volatile uint8_t rf_reg_0f03;
	volatile uint8_t rf_reg_0f15;
	volatile uint8_t rf_reg_0f16;
	volatile uint8_t rf_reg_0428;
	volatile uint8_t rf_reg_0430;
	/*
	 * Cycle-counter snapshots for ACK-path latency profiling.  Captured on
	 * every ack-requested RX so the SWS-side reader gets a consistent set:
	 *
	 *  isr_entry_cyc      — first instruction of tlsr8258_rf_isr
	 *  ack_capture_cyc    — timestamp immediately after switching to TX mode
	 *  pre_busy_wait_cyc  — right before the cycle-domain spin in send_ack
	 *  tx_kick_cyc        — right before tlsr8258_rf_tx_pkt for the ACK
	 *  tx_done_cyc        — after TX_DS / CMD_DONE wait, before set_rxmode
	 *
	 * Time deltas (microseconds) computed by the driver into the matching
	 * _us fields so they can be read directly without a software divide.
	 */
	volatile uint32_t isr_entry_cyc;
	volatile uint32_t ack_capture_cyc;
	volatile uint32_t pre_busy_wait_cyc;
	volatile uint32_t tx_kick_cyc;
	volatile uint32_t tx_done_cyc;
	volatile uint16_t isr_to_capture_us;
	volatile uint16_t capture_to_wait_us;
	volatile uint16_t wait_duration_us;
	volatile uint16_t tx_send_duration_us;
	/*
	 * Inter-ISR gap profiling. Each rf_isr entry computes the duration
	 * since the previous entry; we track the LAST gap and the MAX seen so
	 * far. If RF IRQ delivery is being delayed by a CPU-busy / IRQ-masked
	 * critical section, inter_isr_gap_max_us will spike well above the
	 * coordinator's macAckWaitDuration (864us).
	 */
	volatile uint32_t prev_isr_entry_cyc;
	volatile uint32_t inter_isr_gap_us;
	volatile uint32_t inter_isr_gap_max_us;
};

