devbis/zephyr-tlsr8258/drivers/ieee802154/ieee802154_tlsr8258.c
struct tlsr8258_radio_data {
	struct net_if *iface;
	uint8_t mac_addr[TLSR8258_IEEE_ADDR_SIZE];
	uint8_t rx_buffer[TLSR8258_RX_BUF_SIZE] __aligned(4);
	uint8_t rx_shadow[TLSR8258_RX_BUF_SIZE] __aligned(4);
	uint8_t tx_buffer[TLSR8258_TX_BUF_SIZE] __aligned(4);
	/*
	 * MAC ACKs are emitted from the RX ISR while a normal TX may still be
	 * completing in the RF/DMA state machine.  Keep their DMA descriptor in a
	 * separate buffer: reusing tx_buffer here can replace an encrypted NWK
	 * frame with the next frame's plaintext while DMA3 is still on it.
	 */
	uint8_t ack_buffer[TLSR8258_TX_BUF_SIZE] __aligned(4);
	/*
	 * Double-buffered RX (vendor mac_phy.c model). rx_active = the buffer the
	 * RF DMA is currently filling; on each RX-done the ISR swaps the DMA to the
	 * other of {rx_buffer, rx_shadow} BEFORE processing, so the next frame lands
	 * in a fresh buffer while rx_proc (the just-filled one) is consumed. This is
	 * what lets the router receive a frame arriving immediately after its own
	 * ACK-requested poll (the ASSOCIATION-RESPONSE) — a single buffer misses it.
	 */
	uint8_t *rx_active;
	uint8_t *rx_proc;
	uint8_t filter_pan_id[TLSR8258_PAN_ID_SIZE];
	uint8_t filter_short_addr[TLSR8258_SHORT_ADDR_SIZE];
	uint8_t filter_ieee_addr[TLSR8258_IEEE_ADDR_SIZE];
	uint16_t current_channel;
	uint16_t last_irq;
	uint32_t rx_count;
	uint32_t tx_count;
	struct tlsr8258_radio_op op;
	struct k_sem tx_wait;
	struct tlsr8258_rx_queue rx_queue;
	struct tlsr8258_rx_slot rx_slots[TLSR8258_RX_SLOT_COUNT];
	struct tlsr8258_radio_debug *debug;
	bool started;
	bool promiscuous;
};

/*
 * The RF ISR runs from RAM while the TLSR8258 XIP/cache path is in a
 * restricted state.  Do not make it dereference a Zephyr `struct device`
 * argument: the device object is in flash, and the `dev->data` load can
 * stall the core before the ISR has even recorded its diagnostics.  Pass
 * this RAM object directly as the IRQ argument instead.
 */
static struct tlsr8258_radio_data tlsr8258_radio_data_0;

static const struct tblcmdset tbl_rf_init[] = {
	{0x12d2, 0x9b, 0xc3}, {0x12d3, 0x19, 0xc3}, {0x127b, 0x0e, 0xc3},
	{0x1276, 0x50, 0xc3}, {0x1277, 0x73, 0xc3}, {0x0430, 0x3e, 0xc3},
};

static const struct tblcmdset tbl_rf_zigbee_250k[] = {
	{0x1220, 0x04, 0xc3}, {0x1221, 0x2b, 0xc3}, {0x1222, 0x43, 0xc3},
	{0x1223, 0x86, 0xc3}, {0x122a, 0x90, 0xc3}, {0x1254, 0x0e, 0xc3},
	{0x1255, 0x09, 0xc3}, {0x1256, 0x0c, 0xc3}, {0x1257, 0x08, 0xc3},
	{0x1258, 0x09, 0xc3}, {0x1259, 0x0f, 0xc3}, {0x0400, 0x13, 0xc3},
	{0x0420, 0x18, 0xc3}, {0x0402, 0x46, 0xc3}, {0x0404, 0xc0, 0xc3},
	{0x0405, 0x04, 0xc3}, {0x0421, 0x23, 0xc3}, {0x0422, 0x04, 0xc3},
	{0x0408, 0xa7, 0xc3}, {0x0409, 0x00, 0xc3}, {0x040a, 0x00, 0xc3},
	{0x040b, 0x00, 0xc3}, {0x0460, 0x36, 0xc3}, {0x0461, 0x46, 0xc3},
	{0x0462, 0x51, 0xc3}, {0x0463, 0x61, 0xc3}, {0x0464, 0x6d, 0xc3},
	{0x0465, 0x78, 0xc3},
};

static const uint8_t rf_power_level_list[] = {
	0x3f, 0x3d, 0x3a, 0x38, 0x35, 0x33, 0x31, 0x2f, 0x2d, 0x2b,
	0x29, 0x27, 0x25, 0x23, 0x21, 0x1f, 0x1d, 0x1b, 0x19, 0x17,
	0xbf, 0xbd, 0xbb, 0xb9, 0xb6, 0xb4, 0xb2, 0xb0, 0xae, 0xac,
	0xa9, 0xa8, 0xa4, 0xa2, 0xa0, 0x9e, 0x9c, 0x9a, 0x98, 0x96,
	0x94, 0x92, 0x90, 0x8e, 0x8c, 0x8a, 0x88, 0x86, 0x84, 0x82,
};

static int tlsr8258_set_tx_payload(struct tlsr8258_radio_data *radio, const uint8_t *payload,
				   uint8_t payload_len);
static int tlsr8258_set_tx_payload_to(uint8_t *tx_buffer, const uint8_t *payload,
					      uint8_t payload_len);
static void tlsr8258_rx_capture_common(uint16_t irq_status, uint8_t *snapshot,
				       uint16_t snapshot_size,
				       struct tlsr8258_radio_data *radio);
static void tlsr8258_rx_capture_isr(uint16_t irq_status, struct tlsr8258_radio_data *radio);
static void tlsr8258_rf_irq_reenable(void);
static void tlsr8258_rf_irq_reenable_thread_ctx(void);
static void tlsr8258_rf_rx_buffer_set(uint8_t *buffer, uint16_t size);
static void tlsr8258_rf_set_rxmode_vendor(void);
static void tlsr8258_rf_rearm_idle_rx(struct tlsr8258_radio_data *radio);
static bool tlsr8258_rf_recover_stuck_rx(struct tlsr8258_radio_data *radio);
static bool tlsr8258_filter_match_for_ack(const uint8_t *payload, uint8_t length,
						  const struct tlsr8258_radio_data *radio);
static bool tlsr8258_ack_requested(const uint8_t *payload, uint8_t length);

#if defined(CONFIG_IEEE802154_TLSR8258_RETAINED_DEBUG)
static struct tlsr8258_radio_debug __noinit tlsr8258_radio_debug_state;
#endif

static struct tlsr8258_radio_debug *tlsr8258_radio_debug_get(struct tlsr8258_radio_data *radio)
{
	return radio->debug;
}

static void tlsr8258_tx_diag_put(struct tlsr8258_radio_data *radio, uint32_t word)
{
	struct tlsr8258_radio_debug *debug = tlsr8258_radio_debug_get(radio);
	uint8_t head;

	if (debug == NULL) {
		return;
	}

	head = debug->tx_diag_trace_head;
	debug->tx_diag_trace[head & (ARRAY_SIZE(debug->tx_diag_trace) - 1u)] = word;
	debug->tx_diag_trace_head = head + 1u;
}

static void tlsr8258_rf_debug_reset(struct tlsr8258_radio_data *radio)
{
	struct tlsr8258_radio_debug *debug = tlsr8258_radio_debug_get(radio);

	if (debug == NULL) {
		return;
	}

	memset((void *)debug, 0, sizeof(*debug));
}

/*
 * TC32 LLVM has miscompiled direct accesses to the scalar tail of
 * tlsr8258_radio on hardware, e.g. tlsr8258_tx() read tx_buffer[4] where the
 * source asked for started. Use explicit offset-based volatile helpers for
 * those tail fields so codegen materializes the correct address.
 */
static inline volatile uint8_t *tlsr8258_radio_u8_field(struct tlsr8258_radio_data *radio,
							size_t offset)
{
	return (volatile uint8_t *)((volatile uint8_t *)radio + offset);
}

static inline volatile uint16_t *tlsr8258_radio_u16_field(struct tlsr8258_radio_data *radio,
							  size_t offset)
{
	return (volatile uint16_t *)((volatile uint8_t *)radio + offset);
}

static inline volatile uint32_t *tlsr8258_radio_u32_field(struct tlsr8258_radio_data *radio,
							  size_t offset)
{
	return (volatile uint32_t *)((volatile uint8_t *)radio + offset);
}

static inline uint16_t tlsr8258_radio_current_channel_get(struct tlsr8258_radio_data *radio)
{
	return *tlsr8258_radio_u16_field(radio,
					 offsetof(struct tlsr8258_radio_data, current_channel));
}

static inline void tlsr8258_radio_current_channel_set(struct tlsr8258_radio_data *radio,
						      uint16_t channel)
{
	*tlsr8258_radio_u16_field(radio,
				  offsetof(struct tlsr8258_radio_data, current_channel)) = channel;
}

static inline void tlsr8258_radio_last_irq_set(struct tlsr8258_radio_data *radio, uint16_t irq)
{
	*tlsr8258_radio_u16_field(radio, offsetof(struct tlsr8258_radio_data, last_irq)) = irq;
}

static inline void tlsr8258_radio_rx_count_inc(struct tlsr8258_radio_data *radio)
{
	(*tlsr8258_radio_u32_field(radio, offsetof(struct tlsr8258_radio_data, rx_count)))++;
}

static inline void tlsr8258_radio_tx_count_inc(struct tlsr8258_radio_data *radio)
{
	(*tlsr8258_radio_u32_field(radio, offsetof(struct tlsr8258_radio_data, tx_count)))++;
}

static inline bool tlsr8258_radio_started_get(struct tlsr8258_radio_data *radio)
{
	return *tlsr8258_radio_u8_field(radio, offsetof(struct tlsr8258_radio_data, started)) != 0u;
}

static inline void tlsr8258_radio_started_set(struct tlsr8258_radio_data *radio, bool started)
{
	*tlsr8258_radio_u8_field(radio, offsetof(struct tlsr8258_radio_data, started)) =
		started ? 1u : 0u;
}

bool tlsr8258_pm_radio_can_suspend(void)
{
	return !tlsr8258_radio_started_get(&tlsr8258_radio_data_0);
}

static inline void tlsr8258_radio_promiscuous_set(struct tlsr8258_radio_data *radio,
						  bool promiscuous)
{
	*tlsr8258_radio_u8_field(radio, offsetof(struct tlsr8258_radio_data, promiscuous)) =
		promiscuous ? 1u : 0u;
}

/* ack_tx_pending is written by the RF ISR and read by the Zigbee thread.
 * Keep this read volatile and offset-based: the TC32 LLVM backend has already
 * demonstrated bad codegen for scalar members in this driver structure. */
static inline bool tlsr8258_ack_tx_pending_get(struct tlsr8258_radio_data *radio)
{
	return *((volatile uint8_t *)((volatile uint8_t *)&radio->op +
					 offsetof(struct tlsr8258_radio_op, ack_tx_pending))) != 0u;
}

static inline bool tlsr8258_radio_promiscuous_get(struct tlsr8258_radio_data *radio)
{
	return *tlsr8258_radio_u8_field(radio,
					offsetof(struct tlsr8258_radio_data, promiscuous)) != 0u;
}

static tlsr8258_zigbee_rx_sink_t tlsr8258_zigbee_rx_sink;

