devbis/zephyr-tlsr8258/drivers/ieee802154/ieee802154_tlsr8258.c
/*
 * Keep the Zigbee filter request across radio initialisation.  The restored
 * router state is applied before the late device_init() fallback can run;
 * tlsr8258_init() clears radio_data with memset(), so fields written directly
 * into radio_data at that point would otherwise be lost.
 */
static uint8_t tlsr8258_filter_pan_id_shadow[TLSR8258_PAN_ID_SIZE] = {0xffu, 0xffu};
static uint8_t tlsr8258_filter_short_addr_shadow[TLSR8258_SHORT_ADDR_SIZE] = {0xffu, 0xffu};
static uint8_t tlsr8258_filter_ieee_addr_shadow[TLSR8258_IEEE_ADDR_SIZE];
/*
 * Keep the logical channel outside radio_data as well.  A late device_init()
 * fallback clears radio_data with memset(); restoring the hard-coded channel
 * 11 there leaves the joined router deaf while the MAC PIB still says 25.
 */
#if defined(CONFIG_ZIGBEE_CHANNEL) && (CONFIG_ZIGBEE_CHANNEL >= 11) && \
	(CONFIG_ZIGBEE_CHANNEL <= 26)
static uint16_t tlsr8258_channel_shadow = (uint16_t)CONFIG_ZIGBEE_CHANNEL;
#else
static uint16_t tlsr8258_channel_shadow = 11u;
#endif

static inline struct tlsr8258_radio_data *tlsr8258_zigbee_radio_data_get(void)
{
	const struct device *dev = DEVICE_DT_GET(DT_NODELABEL(zb));

	return (dev != NULL) ? dev->data : NULL;
}

void tlsr8258_zigbee_register_rx_sink(tlsr8258_zigbee_rx_sink_t sink)
{
	tlsr8258_zigbee_rx_sink = sink;
}

void tlsr8258_zigbee_update_filters(uint16_t pan_id, uint16_t short_addr,
				    const uint8_t *ieee_addr)
{
	struct tlsr8258_radio_data *radio = tlsr8258_zigbee_radio_data_get();

	sys_put_le16(pan_id, tlsr8258_filter_pan_id_shadow);
	sys_put_le16(short_addr, tlsr8258_filter_short_addr_shadow);
	if (ieee_addr != NULL) {
		memcpy(tlsr8258_filter_ieee_addr_shadow, ieee_addr,
		       TLSR8258_IEEE_ADDR_SIZE);
	}

	if (radio == NULL) {
		return;
	}

	sys_put_le16(pan_id, radio->filter_pan_id);
	sys_put_le16(short_addr, radio->filter_short_addr);
	if (ieee_addr != NULL) {
		memcpy(radio->filter_ieee_addr, ieee_addr, TLSR8258_IEEE_ADDR_SIZE);
	}
}

/*
 * RX is armed once at radio start and is restored only at real RX/TX
 * ownership handoffs.  Do not periodically write the RF state registers from
 * the Zigbee thread: on TLSR8258 that creates an artificial TX/RX window and
 * can reset the LL state machine while a coordinator frame is arriving.
 *
 * Keep normal continuously-armed RX untouched here.  The guard repairs the
 * CPU interrupt mask if a TX handoff/arch IRQ path dropped ZB_RT, and only
 * resets RX DMA when the impossible tuple (RF_RX pending, no CPU source) is
 * observed.  This is the same CPU-side recovery contract as zigbee-rs, with
 * an additional hardware-latch escape hatch for the C port.
 */
void tlsr8258_zigbee_idle_rx_guard(void)
{
	struct tlsr8258_radio_data *radio = tlsr8258_zigbee_radio_data_get();
	uint8_t irq_en;
	static uint8_t stuck_tx_checks;

	if (radio == NULL) {
		return;
	}

	/*
	 * TLSR8258 can leave the RF completion latch asserted while its parent CPU
	 * source is masked.  Recover that specific impossible state below.  Do not
	 * periodically re-arm based only on an unchanged RX counter: register
	 * 0x0c26 (reg_dma_rx_rdy0) reads as 0x04 while RX DMA is armed, so treating
	 * it as a pending completion causes a reset/re-arm every 250 ms and creates
	 * the very idle-deaf window this guard is meant to repair.
	 */
	/* The MAC can issue TRX_OFF during the join/interview handoff after the
	 * RF start path has already armed RX.  In that narrow path the PHY remains
	 * active, but the driver's software `started` bit is cleared; subsequent
	 * API TX calls then return -ENETDOWN and the router becomes receive-only.
	 * Recover only this coherent hardware/software mismatch. */
	if (!tlsr8258_radio_started_get(radio) &&
	    TLSR_REG8(0x0f02) != RF_TRX_OFF &&
	    (TLSR_REG8(0x0c20) & DMA_CHN_RF_RX) != 0u) {
		tlsr8258_radio_started_set(radio, true);
	}
	if ((TLSR_REG32(0x0640) & BIT(TLSR8258_IRQ_ZB_RT)) == 0u) {
		tlsr8258_rf_irq_reenable_thread_ctx();
	}

	/*
	 * The RF vector clears the chip-level IRQ gate (0x800643) on entry.
	 * Normally tlsr8258_rf_irq_reenable() restores it from the ISR, but a
	 * TX/RX handoff can leave the RF/DMA mask valid while the global gate is
	 * still clear.  In that state RF completion remains pending forever and
	 * the router is deaf even though the radio is visibly in RX mode.  This
	 * guard runs from the normal Zigbee thread, outside an irq_lock() critical
	 * section, so restoring the gate here is safe and does not reset the RF
	 * state machine.
	 */
	irq_en = TLSR_REG8(0x0643);
	if ((irq_en & BIT(0)) == 0u) {
		TLSR_REG8(0x0643) = irq_en | BIT(0);
	}

	/*
	 * A TLSR8258 RX completion can survive after the RF ISR has cleared the
	 * parent CPU source.  In that state 0x0f20 says RX is pending, DMA2 is
	 * still enabled, but no new CPU vector can be generated; the router then
	 * hears beacons only intermittently until reboot.  Recover only this
	 * inconsistent tuple.  A normal armed RX has either no RF completion or a
	 * live CPU source, and is left completely untouched.
	 */
	if (tlsr8258_rf_recover_stuck_rx(radio)) {
		tlsr8258_rf_irq_reenable_thread_ctx();
	}

	/*
	 * A completed TX can leave the 8258 TRX state latched at TX-enable
	 * (0x0f02 == 0x55) without a pending RF or DMA interrupt.  There is then
	 * no ISR edge which could execute the normal TX->RX handoff, so the router
	 * remains deaf indefinitely.  This was observed after a successful
	 * interview: the coordinator's remove/read requests were not even
	 * MAC-ACKed, while the software operation was COMPLETE_OK.
	 *
	 * Do not reset the RF while a real stack TX is in flight.  The
	 * ack_tx_pending bit is intentionally not an exclusion here: if the RF
	 * completion edge was lost, that bit is exactly the stale software state
	 * which prevents the router from recovering.  Require two consecutive 1 ms
	 * loop observations of the impossible state so a normal short ACK handoff
	 * is left alone.  The recovery is deliberately conditional and does not
	 * periodically re-enable RX during normal idle operation.
	 */
	if (tlsr8258_radio_started_get(radio) &&
	    TLSR_REG8(0x0f02) == (RF_TRX_OFF | BIT(4)) &&
	    TLSR_REG16(0x0f20) == 0u &&
	    (TLSR_REG8(0x0c20) & DMA_CHN_RF_RX) != 0u &&
	    radio->op.state != TLSR8258_RADIO_OP_TX_PENDING &&
	    radio->op.state != TLSR8258_RADIO_OP_WAITING_POST_TX_RX &&
	    !radio->op.ack_pending) {
		if (stuck_tx_checks < UINT8_MAX) {
			stuck_tx_checks++;
		}
		if (stuck_tx_checks >= 2u) {
			tlsr8258_rf_rearm_idle_rx(radio);
			/* The corresponding TX completion IRQ was lost, so no later ISR
			 * can clear this ACK-only software latch for us. */
			radio->op.ack_tx_pending = false;
			stuck_tx_checks = 0u;
		}
	} else {
		stuck_tx_checks = 0u;
	}
}

static void tlsr8258_load_tbl(const struct tblcmdset *tbl, size_t len)
{
	for (size_t i = 0; i < len; i++) {
		uint8_t cmd = tbl[i].cmd;

		if (((cmd & TCMD_UNDER_WR) != 0u) && ((cmd & TCMD_MASK) == TCMD_WRITE)) {
			TLSR_REG8(tbl[i].adr) = tbl[i].dat;
		}
	}
}

/* Match the hardware-proven SDK/Rust PHY channel sequence. */
static void tlsr8258_rf_set_channel(uint16_t channel)
{
    uint16_t physical;
    uint16_t freq_mhz;
    uint16_t modem_val;
    uint8_t band;

