devbis/zephyr-tlsr8258/drivers/ieee802154/ieee802154_tlsr8258.c
    if (channel < 11u || channel > 26u) {
        return;
    }

    physical = (uint16_t)(channel - 10u) * 5u;
    freq_mhz = (uint16_t)(2400u + physical);
    band = (freq_mhz > 2464u) ? 0x0cu :
           (freq_mhz > 2434u) ? 0x10u : 0x14u;

    /* set_trx_off() in zigbee-rs: stop LL activity before retuning, but
     * leave the PHY mode sequence itself to set_rxmode_vendor() below. */
    TLSR_REG8(0x0f02) = RF_TRX_OFF;
    TLSR_REG8(0x040d) = (uint8_t)physical;
    TLSR_REG16(0x04d6) = freq_mhz;
    modem_val = (uint16_t)((freq_mhz << 2) | 1u);
    TLSR_REG8(0x1244) = (uint8_t)modem_val;
    TLSR_REG8(0x1245) = (uint8_t)((TLSR_REG8(0x1245) & 0xc0u) |
                                  ((modem_val >> 8) & 0x3fu));
    TLSR_REG8(0x1229) = (uint8_t)((TLSR_REG8(0x1229) & 0xc3u) | band);

    for (uint32_t i = 0u; i < 2000u; i++) {
        __asm__ volatile("nop");
    }
}

static void tlsr8258_rf_set_power_level(uint8_t level)
{
	uint8_t power_code = level & 0x3fu;
	uint32_t power_word = (uint32_t)power_code << 24;

	if ((level & BIT(7)) != 0u) {
		TLSR_REG8(0x1225) |= BIT(6);
	} else {
		TLSR_REG8(0x1225) &= (uint8_t)~BIT(6);
	}

	TLSR_REG8(0x1226) = (uint8_t)((TLSR_REG8(0x1226) & 0x7fu) |
				      ((power_word >> 17) & 0x80u));
	TLSR_REG8(0x1227) = (uint8_t)((TLSR_REG8(0x1227) & 0xe0u) |
				      ((power_word >> 25) & 0x1fu));
}

static void tlsr8258_rf_rx_buffer_set(uint8_t *buffer, uint16_t size)
{
	uintptr_t addr = (uintptr_t)buffer;
	ARG_UNUSED(size);

	/*
	 * Vendor-verified RX re-arm (libdrivers_8258.a rf_rx_irq_handler /
	 * mac_phy.c): the RF-RX DMA channel enable (reg_dma_chn_en 0x0c20 bit2 =
	 * FLD_DMA_CHN_RF_RX) MUST be toggled disable->enable each time RX is
	 * re-armed — the vendor does ZB_RADIO_RX_DISABLE at RX-ISR entry and
	 * ZB_RADIO_RX_ENABLE at exit on EVERY frame. Merely re-pointing the RX
	 * buffer address (0x0c08) leaves the DMA channel in its post-transfer
	 * state; after the HW auto-receives the coordinator's ACK to our own
	 * ACK-requested DataReq poll (surfaced as RF_IRQ_TX_DS on the tx-done
	 * path, which never ran the RX ISR), the channel is never re-armed, so
	 * the indirect ASSOCIATION-RESPONSE arriving a few ms later cannot DMA in
	 * and fires no RX IRQ — the join stalls. Our driver previously set 0x0c20
	 * once at init and never again; toggle it here so every RX re-arm resets
	 * the channel exactly like the vendor.
	 */
	/*
	 * Match the proven 8258 PHY rearm sequence.  RF status alone is not
	 * sufficient: the DMA channel and the CPU RF source have their own
	 * latched completion bits.  Leaving either latched makes the next RX
	 * look like an already-consumed DMA transaction and eventually leaves
	 * the router idle-deaf.
	 */
	TLSR_REG8(0x0f20) = RF_IRQ_RX;
	TLSR_REG8(0x0c26) = DMA_CHN_RF_RX;
	TLSR_REG8(0x0c20) &= (uint8_t)~DMA_CHN_RF_RX;
	TLSR_REG16(0x0c08) = (uint16_t)addr;
	TLSR_REG8(0x0c42) = (uint8_t)((addr >> 16) & 0x0fu);
	TLSR_REG8(0x0c0a) = (uint8_t)(TLSR8258_RX_DMA_SIZE >> 4);
	TLSR_REG8(0x0c0b) = 1u;
	TLSR_REG8(0x0c20) |= DMA_CHN_RF_RX;
}

static bool tlsr8258_rf_recover_stuck_rx(struct tlsr8258_radio_data *radio)
{
	const uint32_t cpu_rx_sources = BIT(4) | BIT(TLSR8258_IRQ_ZB_RT);
	bool rf_rx_pending = (TLSR_REG16(0x0f20) & RF_IRQ_RX) != 0u;
	bool global_irq_disabled = (TLSR_REG8(0x0643) & BIT(0)) == 0u;

	/*
	 * A pending RF completion with a live CPU source is normally left alone:
	 * the IRQ vector will consume it.  There is one important exception: the
	 * TLSR global IRQ gate can be cleared by the RF vector while the source
	 * remains asserted.  In that state the source is technically "live", but
	 * no vector can run, so the old source-absent test never repaired it.  This
	 * is the post-join failure mode: the radio reads RX/ DMA-enabled over SWS,
	 * yet the coordinator's unicast retries receive no MAC ACK.
	 */
	if (radio == NULL || !rf_rx_pending ||
	    ((TLSR_REG32(0x0648) & cpu_rx_sources) != 0u && !global_irq_disabled)) {
		return false;
	}

	/* RF/DMA completion is latched but its parent CPU source is gone. Clear the
	 * originating module status and arm a fresh buffer; the caller re-enables
	 * the CPU sources after this reset-free recovery. */
	TLSR_REG8(0x0643) = 0u;
	TLSR_REG16(0x0f20) = RF_IRQ_ALL;
	TLSR_REG8(0x0c26) = DMA_CHN_RF_RX;
	radio->rx_active[0] = 0u;
	radio->rx_active[4] = 0u;
	tlsr8258_rf_rx_buffer_set(radio->rx_active, TLSR8258_RX_DMA_SIZE);
	tlsr8258_rf_set_rxmode_vendor();
	return true;
}

static inline void tlsr8258_rf_tx_status_clear(void)
{
	/* RF TX-done, DMA3 completion, and the shared RF CPU source. */
	/* RF_IRQ_TX_DS is bit 8.  An 8-bit write silently discarded it and
	 * could leave the TX completion latch asserted after a software MAC ACK,
	 * blocking the next always-RX interrupt. */
	TLSR_REG16(0x0f20) = RF_IRQ_TX | RF_IRQ_TX_DS;
	TLSR_REG8(0x0c26) = DMA_CHN_RF_TX;
}

static inline void tlsr8258_rf_cpu_irq_sources_clear(void)
{
	/* 0x0648-0x64a are IRQ source readbacks, not W1C registers.  The
	 * level-triggered CPU sources deassert only after their modules are clear. */
	TLSR_REG16(0x0f20) = RF_IRQ_ALL;
	TLSR_REG8(0x0c26) = DMA_CHN_RF_RX | DMA_CHN_RF_TX;
}

/*
 * Shared body, force-inlined into both callers below so each gets its own
 * complete, independent copy in its own section -- no cross-section call
 * or return between them.
 */
static inline __attribute__((always_inline)) void tlsr8258_rf_irq_reenable_body(void)
{
	uint8_t global_irq = TLSR_REG8(0x0643);
	uint32_t irq_mask;

	/*
	 * RF IRQ entry clears reg_irq_en on this silicon.  irq_enable() only
	 * updates reg_irq_mask, and arch_irq_unlock() would restore the already
	 * cleared value, leaving the CPU deaf after the first RF event.  Keep the
	 * whole handoff in one masked sequence, as in the updated zigbee-rs
	 * always-RX path.
	 *
	 * Do not clear a source if a new RX completion arrived while this ISR was
	 * processing the previous frame: preserving it lets the just-rearmed DMA
	 * buffer trigger the next vector.
	 */
	TLSR_REG8(0x0643) = 0u;
	if ((TLSR_REG16(0x0f20) & RF_IRQ_RX_EVENTS) == 0u) {
		tlsr8258_rf_cpu_irq_sources_clear();
	}
	irq_mask = TLSR_REG32(0x0640);
	/* zigbee-rs CPU_RX_IRQ_MASK = DMA completion (bit4) plus the
	 * baseband ZB_RT source (bit13). Enabling only ZB_RT leaves RF
	 * auto-ACKs working while software RX completions never vector. */
	TLSR_REG32(0x0640) = irq_mask | BIT(4) | BIT(TLSR8258_IRQ_ZB_RT);
	compiler_barrier();
	TLSR_REG8(0x0643) = global_irq | BIT(0);
}

/* ISR-context callers: keep this resident in RAM so the tight ACK-turnaround
 * window is never exposed to a flash cache-miss stall mid-sequence. */
__attribute__((noinline, section(".ram_code")))
static void tlsr8258_rf_irq_reenable(void)
{
	tlsr8258_rf_irq_reenable_body();
}

