devbis/zephyr-tlsr8258/drivers/ieee802154/ieee802154_tlsr8258.c
/*
 * Thread-context caller (tlsr8258_zigbee_idle_rx_guard(), polled every
 * zb_thread loop pass -- not interrupt/timing-critical). Give it its own
 * plain-flash copy instead of jumping into the ISR's .ram_code copy from
 * ordinary flash-resident code: this project has already hit a documented
 * LLVM/TC32 defect where a flash->ram_code call from outside the expected
 * ISR calling context does not reliably return (see the historical
 * _attribute_ram_code_ / __ramfunc wedge). Confirmed on hardware: the whole
 * ZB thread loop can freeze forever (no CPU fault, just stops advancing)
 * while repeatedly polling idle_rx_guard() during an interview retry storm --
 * exactly the access pattern this call site has and the ISR call sites do
 * not. Two independent inlined copies cost a few dozen bytes of flash to
 * avoid ever making that cross-section call from thread context again.
 */
__attribute__((noinline))
static void tlsr8258_rf_irq_reenable_thread_ctx(void)
{
	tlsr8258_rf_irq_reenable_body();
}

static void tlsr8258_rf_tx_pkt(uint8_t *packet)
{
	uintptr_t addr = (uintptr_t)packet;

	/* Exact libdrivers_8258.a::rf_tx_pkt sequence from the original asm.
	 * The vendor sets both TX DMA ready latches.  Leaving reg_dma_tx_rdy1
	 * (0x0c5b) untouched lets the API report a completed TX while the PSDU
	 * never reaches the air after an RX/TX handoff. */
	TLSR_REG8(0x0c43) = 0x04u;
	TLSR_REG16(0x0c0c) = (uint16_t)addr;
	TLSR_REG8(0x0c5b) |= DMA_CHN_RF_TX;
	TLSR_REG8(0x0c24) |= DMA_CHN_RF_TX;
}

/*
 * Fast RX-mode switch that SKIPS the channel-offset reload (the PLL re-lock,
 * tens-to-hundreds of us on TLSR8258 — see tlsr8258_rf_set_txmode_for_ack).
 * The channel is already programmed, so the reload is wasted latency. This
 * matters on the TX-done path: the coordinator's ASSOCIATION-RESPONSE arrives
 * only ~260 us after it ACKs our poll (sniffer-measured), and the full
 * tlsr8258_rf_set_rxmode()'s PLL re-lock left the radio not-yet-listening in
 * that window, so the AssocResp was missed and the join never completed. This
 * mirrors the vendor rf_set_rxmode() which also does no channel reload.
 *
 * Retained for reference but no longer called: unlike set_rxmode_vendor() it
 * still writes 0x0f02 = RF_TRX_OFF first (the TX/RX state-machine reset), which
 * opens a ~200us-13ms deaf window on the TX->RX turnaround. Every post-TX RX
 * re-arm now uses the reset-free set_rxmode_vendor() instead (see the has_tx ISR
 * branch), so unicasts the coordinator sends right after we ACK are not lost.
 */
static void tlsr8258_rf_set_rxmode_fast(void) __maybe_unused;
static void tlsr8258_rf_set_rxmode_fast(void)
{
	TLSR_REG8(0x0f02) = RF_TRX_OFF;
	TLSR_REG8(0x0428) = (uint8_t)(TLSR_REG8(0x0428) | BIT(0));
	TLSR_REG8(0x0f02) = RF_TRX_OFF | BIT(5);
}

/*
 * Vendor-EXACT RX-mode switch (chip_8258/rf_drv.h rf_set_rxmode): ONLY
 *   0x0428 = RF_TRX_MODE | BIT(0)   // rx enable
 *   0x0f02 = RF_TRX_OFF  | BIT(5)   // RX enable
 * Crucially it does NOT write 0x0f02 = RF_TRX_OFF first (the TX/RX state-
 * machine RESET) and does NOT reload the channel/PLL — the vendor switches
 * straight from TX-enable (0x55) to RX-enable (0x65). Our set_rxmode /
 * set_rxmode_fast both insert that 0x45 reset (and set_rxmode also relocks the
 * PLL) on every TX->RX turnaround; the poll TX completes as plain RF_IRQ_TX
 * (confirmed, no auto-ACK), so the coordinator's ACK+AssocResp must be caught
 * as ordinary RX right after — and the reset/relock in that ~200us window is
 * the prime suspect for the radio not being live when the reply lands. Keep
 * 0x0f16 at the vendor's fixed active-session value; it is not switched per
 * TX/RX operation.
 */
static void tlsr8258_rf_set_rxmode_vendor(void)
{
	/* Exact libzigbee/sdk/platform/chip_8258/rf_drv.h::rf_set_rxmode().
	 * The state-machine reset and channel/PLL programming belong to the
	 * explicit TX/RX-off and channel-change paths, not to the idle RX handoff.
	 * Keeping this two-write sequence is what makes the router continuously
	 * receivable immediately after an ACK or normal TX completion. */
	TLSR_REG8(0x0428) = RF_TRX_MODE | BIT(0);
	TLSR_REG8(0x0f02) = RF_TRX_OFF | BIT(5);
}

/* Restore always-RX after a synchronous TX timeout. */
static void tlsr8258_rf_rearm_idle_rx(struct tlsr8258_radio_data *radio)
{
	if (radio->rx_active == NULL) {
		radio->rx_active = radio->rx_buffer;
	}

	radio->rx_active[0] = 0u;
	radio->rx_active[4] = 0u;
	tlsr8258_rf_rx_buffer_set(radio->rx_active, TLSR8258_RX_DMA_SIZE);
	tlsr8258_rf_set_rxmode_vendor();
	TLSR_REG16(0x0f20) = RF_IRQ_ALL;
}

static void tlsr8258_rf_set_txmode(struct tlsr8258_radio_data *radio)
{
	ARG_UNUSED(radio);
	TLSR_REG8(0x0f02) = RF_TRX_OFF;
	TLSR_REG8(0x0f02) = RF_TRX_OFF | BIT(4);
	TLSR_REG8(0x0428) &= (uint8_t)~BIT(0);
}

/*
 * Match zigbee-rs::send_mac_frame() before every ordinary TX.  The
 * association poll has its own copy of this sequence; ordinary ZDP/ZCL TX
 * used to skip it and relied on whatever RF/DMA state the preceding RX or
 * MAC-ACK left behind.  That was sufficient immediately after join but made
 * the first response after a long always-RX idle window disappear while the
 * software TX API still reported success.
 */
static void tlsr8258_rf_prepare_normal_tx(void)
{
	/* Stop the link-layer RX state without using the RF power-off command. */
	TLSR_REG8(0x0f16) = 0x29u;
	TLSR_REG8(0x0428) = RF_TRX_MODE;
	TLSR_REG8(0x0f02) = RF_TRX_OFF;

	/* Clear the TX RF and DMA completion latches owned by this operation. */
	TLSR_REG16(0x0f20) = RF_IRQ_TX | RF_IRQ_TX_DS;
	TLSR_REG8(0x0c26) = DMA_CHN_RF_TX;
	TLSR_REG8(0x0c0e) = (uint8_t)(TLSR8258_TX_BUF_SIZE >> 4);
	TLSR_REG8(0x0c0f) = 0u;
}

/*
 * Fast TX-mode switch for MAC ACK transmission from inside the RX ISR.
 * This is the vendor rf_trx_state_set(RF_MODE_TX) sequence observed in
 * libdrivers_8258.a: reset the link-layer state machine, enable TX, and clear
 * the vendor TX gate bit. Do not reload the channel/PLL in this hot path.
 */
static void tlsr8258_rf_set_txmode_for_ack(void)
{
	/* Match libdrivers_8258.a::rf_trx_state_set(RF_MODE_TX): reset the
	 * RF state machine, enable TX, and disable the RX gate. */
	TLSR_REG8(0x0f02) = RF_TRX_OFF;
	TLSR_REG8(0x0f02) = RF_TRX_OFF | BIT(4);
	TLSR_REG8(0x0428) &= (uint8_t)~BIT(0);
}

static uint16_t tlsr8258_snapshot_rx_frame(struct tlsr8258_radio_data *radio, uint8_t *dst,
					   uint16_t dst_size)
{
	uint8_t *src = radio->rx_proc;
	uint16_t dma_len = (uint16_t)src[0] + 4u;
	uint16_t copy_len;

	if (dst == NULL || dst_size == 0u) {
		return 0u;
	}

	copy_len = MAX(dma_len, TLSR8258_PAYLOAD_OFFSET);
	copy_len = MIN(copy_len, (uint16_t)TLSR8258_RX_BUF_SIZE);
	copy_len = MIN(copy_len, dst_size);
	memcpy(dst, src, copy_len);

