devbis/zephyr-tlsr8258/drivers/ieee802154/ieee802154_tlsr8258.c
	return copy_len;
}

static uint8_t tlsr8258_dma_payload_len_get(const uint8_t *rx, uint16_t dma_total_len)
{
	uint8_t payload_len;
	uint8_t fallback_len;
	uint16_t available_len;

	if ((rx == NULL) || (dma_total_len < TLSR8258_PAYLOAD_OFFSET)) {
		return 0u;
	}

	available_len = dma_total_len - TLSR8258_PAYLOAD_OFFSET;
	payload_len = rx[4];
	if ((payload_len >= 2u) && (payload_len <= available_len)) {
		return payload_len;
	}

	if (rx[0] < 9u) {
		return 0u;
	}

	fallback_len = (uint8_t)(rx[0] - 9u);
	if ((fallback_len >= 2u) && (fallback_len <= available_len)) {
		return fallback_len;
	}

	return 0u;
}

static uint8_t tlsr8258_mac_hdr_size(uint16_t fcf, uint8_t psdu_len)
{
	uint8_t idx = 3u;
	uint8_t dst_mode = (uint8_t)((fcf >> 10) & 0x03u);
	uint8_t src_mode = (uint8_t)((fcf >> 14) & 0x03u);

	if (psdu_len < idx) {
		return 0u;
	}

	if (dst_mode != 0u) {
		idx += TLSR8258_PAN_ID_SIZE;
		idx += (dst_mode == 0x03u) ? TLSR8258_IEEE_ADDR_SIZE : TLSR8258_SHORT_ADDR_SIZE;
	}

	if (src_mode != 0u) {
		if ((fcf & BIT(6)) == 0u) {
			idx += TLSR8258_PAN_ID_SIZE;
		}
		idx += (src_mode == 0x03u) ? TLSR8258_IEEE_ADDR_SIZE : TLSR8258_SHORT_ADDR_SIZE;
	}

	return (idx <= psdu_len) ? idx : 0u;
}

/*
 * self-originated / src-matches-local / data-req / beacon-req helpers moved to
 * tlsr8258_core_* in ieee802154_tlsr8258_fake_phy_core.h and are now driven via
 * tlsr8258_core_rx_ack_decision() so the RX-ISR ACK decision is covered by the
 * tlsr8258_rx_ack_decision host unit test.
 */

static bool tlsr8258_psdu_is_ack_for_seq(const uint8_t *psdu, uint8_t psdu_len, uint8_t seq)
{
	return tlsr8258_core_psdu_is_ack_for_seq(psdu, psdu_len, seq);
}

static bool tlsr8258_psdu_is_pending_response(const uint8_t *psdu, uint8_t psdu_len, uint8_t seq,
					      const struct tlsr8258_radio_data *radio)
{
	struct tlsr8258_core_filter_ctx filter;
	struct tlsr8258_core_rx_result result;

	if (psdu == NULL) {
		return false;
	}

	filter = (struct tlsr8258_core_filter_ctx){
		.pan_id = radio->filter_pan_id,
		.short_addr = radio->filter_short_addr,
		.ieee_addr = radio->filter_ieee_addr,
	};
	tlsr8258_core_handle_rx_frame(psdu, psdu_len, seq, &filter, &result);

	return result.is_pending_response;
}

static void tlsr8258_rf_off(void)
{
	TLSR_REG8(0x0f00) = 0x80u;
	TLSR_REG8(0x0f16) = 0x29u;
	TLSR_REG8(0x0428) = RF_TRX_MODE;
	TLSR_REG8(0x0f02) = RF_TRX_OFF;
	/* Keep the vendor's fixed active-session LL mode across RF off/on. */
}

static void tlsr8258_rf_init(void)
{
	/* Required clock/reset release from the hardware-proven PHY init. */
	TLSR_REG8(0x0065) = 0xffu;
	TLSR_REG8(0x0060) = 0u;
	TLSR_REG8(0x0061) = 0u;
	TLSR_REG8(0x0062) = 0u;
	TLSR_REG8(0x0063) = 0xffu;
	TLSR_REG8(0x0064) = 0xffu;

	tlsr8258_load_tbl(tbl_rf_init, ARRAY_SIZE(tbl_rf_init));
	tlsr8258_load_tbl(tbl_rf_zigbee_250k, ARRAY_SIZE(tbl_rf_zigbee_250k));
}

/* rx_length_ok / rx_crc_ok are used by the RX ISR (tlsr8258_rx_capture_common)
 * in every config, so they must live OUTSIDE the CONFIG_IEEE802154_RAW_MODE
 * (net-stack path) guard below. */
static bool tlsr8258_rx_length_ok(const uint8_t *rx)
{
	/*
	 * Vendor RF_ZIGBEE_PACKET_LENGTH_OK (platform/.../rf_drv.h,
	 * mac_phy.c rf_rx_irq_handler): a real Zigbee RX DMA buffer has its length
	 * header (rx[0]) consistent with the PHY payload-length byte (rx[4]):
	 *   rx[0] == rx[4] + 9
	 * On a busy channel the radio also DMAs noise / collisions whose rx[0]/rx[4]
	 * are inconsistent (garbage). The consistency check rejects those; also bound
	 * rx[0] so the CRC-status read rx[rx[0]+3] stays inside the RX buffer.
	 */
	if (((uint16_t)rx[0] + 3u) >= TLSR8258_RX_BUF_SIZE) {
		return false;
	}

	return (uint16_t)rx[0] == (uint16_t)rx[4] + 9u;
}

static bool tlsr8258_rx_crc_ok(const uint8_t *rx)
{
	return (rx[rx[0] + 3u] & 0x51u) == 0x10u;
}

/*
 * This filter is also used before the Zigbee RX sink is called.  The TLSR
 * sample enables CONFIG_IEEE802154_RAW_MODE because it bypasses Zephyr's
 * net_pkt path, but that does not make the Zigbee sink promiscuous: unrelated
 * frames must not consume the deferred RX slots while a joining ED is waiting
 * for its Association Response.
 */
static bool tlsr8258_filter_match(struct tlsr8258_radio_data *radio, uint8_t *payload)
{
	uint16_t filter_pan;
	uint8_t frame_type;

	if (tlsr8258_radio_promiscuous_get(radio)) {
		return true;
	}

	frame_type = payload[TLSR8258_FRAME_TYPE_OFFSET] & 0x07u;
	if (frame_type == IEEE802154_FRAME_TYPE_BEACON) {
		/*
		 * Beacon frames carry no destination addressing, so the normal
		 * short/IEEE destination filter below would reject every active
		 * scan response once promiscuous mode is disabled. Router join
		 * relies on receiving coordinator beacons after our beacon
		 * request, and the higher MAC/NWK layers already validate PAN /
		 * payload content before using them.
		 */
		return true;
	}

	/*
	 * Mirror the auto-ACK filter's PAN logic: when our filter PAN is
	 * still the wildcard 0xFFFF (pre-association / pre-rejoin), accept
	 * frames addressed to our IEEE on ANY PAN. Otherwise the IEEE
	 * 802.15.4 ASSOCIATION-RESPONSE — sent by the coordinator with its
	 * own PAN ID and our extaddr as dst — is dropped by the receive
	 * filter even though the auto-ACK fires for it, and the joining
	 * device sits in tl_zbWaitForAssociationRespTimeout forever.
	 */
	filter_pan = sys_get_le16(radio->filter_pan_id);
	if ((filter_pan != 0xffffu) &&
	    memcmp(&payload[TLSR8258_PAN_ID_OFFSET], radio->filter_pan_id,
		   TLSR8258_PAN_ID_SIZE) != 0 &&
	    sys_get_le16(&payload[TLSR8258_PAN_ID_OFFSET]) != 0xffffu) {
		return false;
	}

	switch (payload[TLSR8258_DEST_ADDR_TYPE_OFFSET] & TLSR8258_DEST_ADDR_TYPE_MASK) {
	case TLSR8258_DEST_ADDR_TYPE_SHORT:
		return memcmp(&payload[TLSR8258_DEST_ADDR_OFFSET], radio->filter_short_addr,
			      TLSR8258_SHORT_ADDR_SIZE) == 0 ||
		       sys_get_le16(&payload[TLSR8258_DEST_ADDR_OFFSET]) == 0xffffu;
	case TLSR8258_DEST_ADDR_TYPE_IEEE:
		return memcmp(&payload[TLSR8258_DEST_ADDR_OFFSET], radio->filter_ieee_addr,
			      TLSR8258_IEEE_ADDR_SIZE) == 0;
	default:
		return false;
	}
}

