devbis/zephyr-tlsr8258/drivers/ieee802154/ieee802154_tlsr8258.c
/*
 * Association Response is the one valid inbound frame that can be addressed
 * to our IEEE while the radio's PAN/short filters still describe the previous
 * network (or the pre-association state).  The hardware already ACKs it, so
 * the software receive filter must not ACK-and-drop it before MLME sees it.
 */
static bool tlsr8258_assoc_resp_for_us(const struct tlsr8258_radio_data *radio,
					       const uint8_t *payload, uint8_t length)
{
	uint16_t fcf;
	uint8_t hdr_len;

	if ((payload[TLSR8258_FRAME_TYPE_OFFSET] & 0x07u) != 0x03u ||
	    (payload[TLSR8258_DEST_ADDR_TYPE_OFFSET] & TLSR8258_DEST_ADDR_TYPE_MASK) !=
		TLSR8258_DEST_ADDR_TYPE_IEEE) {
		return false;
	}

	fcf = sys_get_le16(payload);
	hdr_len = tlsr8258_mac_hdr_size(fcf, length);

	return hdr_len != 0u && (uint16_t)(hdr_len + 4u) <= length &&
	       payload[hdr_len] == 0x02u && /* MAC_CMD_ASSOCIATION_RESPONSE */
	       payload[hdr_len + 3u] == 0x00u && /* MAC_SUCCESS */
	       memcmp(&payload[TLSR8258_DEST_ADDR_OFFSET], radio->filter_ieee_addr,
		       TLSR8258_IEEE_ADDR_SIZE) == 0;
}

static uint8_t tlsr8258_lqi_from_rssi(int8_t rssi)
{
	int32_t lqi;

	if (rssi < TLSR8258_RSSI_TO_LQI_MIN) {
		return 0u;
	}

	lqi = TLSR8258_RSSI_TO_LQI_SCALE * (rssi - TLSR8258_RSSI_TO_LQI_MIN);
	return (uint8_t)MIN(lqi, 0xff);
}

/*
 * Thin wrappers over the pure, host-testable decision logic in
 * ieee802154_tlsr8258_ack_filter.h. Keep the actual matching rules THERE so
 * tests/unit/zigbee_ack_filter_match covers exactly what runs on hardware.
 */
static bool tlsr8258_filter_match_for_ack(const uint8_t *payload, uint8_t length,
					  const struct tlsr8258_radio_data *radio)
{
	struct tlsr8258_core_filter_ctx filter = {
		.pan_id = radio->filter_pan_id,
		.short_addr = radio->filter_short_addr,
		.ieee_addr = radio->filter_ieee_addr,
	};

	return tlsr8258_ackf_dst_matches_filter(payload, filter.pan_id, filter.short_addr,
						filter.ieee_addr) ||
		tlsr8258_core_assoc_resp_to_ieee(payload, length, &filter);
}

static bool tlsr8258_ack_requested(const uint8_t *payload, uint8_t length)
{
	return tlsr8258_ackf_ack_requested(payload, length);
}

static void tlsr8258_send_ack_if_needed(const uint8_t *payload, uint8_t length,
					bool tx_prepared, uint32_t tx_prepared_at_cycles,
					uint32_t rx_complete_at_cycles,
					struct tlsr8258_radio_data *radio)
{
	/*
	 * Hot-path layout (option D):
	 *   - Caller (rx_capture_common) has already verified ack_requested via
	 *     tlsr8258_ack_requested() — do NOT re-check here.
	 *   - ACK PSDU is built from a 3-byte template (frame-control + seq);
	 *     only the seq byte changes per ACK, so writing it inline avoids the
	 *     stack copy that the previous local array forced.
	 *   - Settle is measured from the RX-completion timestamp, matching
	 *     zigbee-rs; only the remaining part of the 120us window is spun.
	 *   - All radio->debug stores have moved out of the timing-critical
	 *     window; they only run after the ACK is on air.
	 */
	uint8_t ack_psdu[3];
	uint32_t elapsed_cyc;
	uint16_t waited = 0u;

	/*
	 * During association the PAN/short filter still contains the invalid
	 * pre-join tuple (normally 0xffff/0xffff), while the coordinator's
	 * successful Association Response is addressed to our IEEE address.
	 * It is already accepted by the RX software filter below; it must also
	 * be ACKed here, otherwise the coordinator keeps retransmitting the
	 * response and never queues the Transport-Key burst.
	 */
	bool ack_filter_match = tlsr8258_filter_match_for_ack(payload, length, radio);
	if (!ack_filter_match) {
		if (tx_prepared) {
			tlsr8258_rf_set_rxmode_vendor();
			TLSR_REG16(0x0f20) = RF_IRQ_ALL;
		}
		return;
	}

	ack_psdu[0] = 0x02u;
	ack_psdu[1] = 0x00u;
	ack_psdu[2] = payload[2];
	if (tlsr8258_set_tx_payload_to(radio->ack_buffer, ack_psdu,
				       sizeof(ack_psdu)) < 0) {
		if (tx_prepared) {
			tlsr8258_rf_set_rxmode_vendor();
			TLSR_REG16(0x0f20) = RF_IRQ_ALL;
		}
		return;
	}

	if (!tx_prepared) {
		tlsr8258_rf_set_txmode(radio);
		tx_prepared_at_cycles = k_cycle_get_32();
	}

	uint32_t pre_wait_cyc = k_cycle_get_32();
	if (radio->debug != NULL) {
		radio->debug->pre_busy_wait_cyc = pre_wait_cyc;
		uint32_t delta =
			(pre_wait_cyc - tx_prepared_at_cycles) /
			(CONFIG_SYS_CLOCK_HW_CYCLES_PER_SEC / 1000000u);
		radio->debug->capture_to_wait_us =
			(uint16_t)((delta > 0xffffu) ? 0xffffu : delta);
	}

	/*
	 * Cycle-domain busy-wait. The timestamp is taken at RX completion (the
	 * ISR-entry timestamp is the closest available C equivalent), not after
	 * the TX handoff or frame parsing. This is the same remaining-settle
	 * calculation used by zigbee-rs::send_ack_fast().
	 */
	do {
		elapsed_cyc = k_cycle_get_32() - rx_complete_at_cycles;
	} while (elapsed_cyc < TLSR8258_ACK_TURNAROUND_CYC);

	TLSR_REG16(0x0f20) = RF_IRQ_ALL;
	uint32_t tx_kick_cyc = k_cycle_get_32();
	if (radio->debug != NULL) {
		radio->debug->tx_kick_cyc = tx_kick_cyc;
		uint32_t delta =
			(tx_kick_cyc - pre_wait_cyc) /
			(CONFIG_SYS_CLOCK_HW_CYCLES_PER_SEC / 1000000u);
		radio->debug->wait_duration_us =
			(uint16_t)((delta > 0xffffu) ? 0xffffu : delta);
	}
	tlsr8258_rf_tx_pkt(radio->ack_buffer);

	/*
	 * Complete the MAC-ACK handoff before leaving this RX ISR, matching
	 * libzigbee/platform/chip_8258/rf_drv.h::rf_rx_irq_handler().  The
	 * TLSR8258 does not reliably generate a follow-up TX-done CPU edge for
	 * this short, software-triggered ACK.  Deferring the wait therefore
	 * leaves the RF state machine in TX (0x0f02 == 0x55), and the next
	 * coordinator request arrives while the router is deaf.  The old
	 * deferred version relied on the idle guard to repair that state, but
	 * the repair is necessarily too late for the next unicast.
	 *
	 * Keep the wait bounded.  A normal three-byte ACK completes well below
	 * this limit; on a lost completion latch we still clear the TX status
	 * and force the reset-free vendor TX->RX transition before returning.
	 * RX DMA is re-armed by the caller after this function returns.
	 */
	uint32_t ack_wait_start = k_cycle_get_32();
	uint32_t ack_wait_budget =
		(uint32_t)CONFIG_SYS_CLOCK_HW_CYCLES_PER_SEC / 2000u; /* 500 us */

	while ((TLSR_REG16(0x0f20) & (RF_IRQ_TX | RF_IRQ_TX_DS)) == 0u &&
	       (k_cycle_get_32() - ack_wait_start) < ack_wait_budget) {
		k_busy_wait(1u);
	}

	tlsr8258_rf_tx_status_clear();
	tlsr8258_rf_set_rxmode_vendor();
	radio->op.ack_tx_pending = false;
	(void)waited;
}

static int8_t tlsr8258_rx_rssi_dbm(const uint8_t *rx)
{
	if (rx[0] < (TLSR8258_RX_BUF_SIZE - 2u)) {
		return (int8_t)rx[rx[0] + 2u] - 110;
	}

