devbis/zephyr-tlsr8258/drivers/ieee802154/ieee802154_tlsr8258.c
	return -110;
}

static void tlsr8258_rx_capture_common(uint16_t irq_status, uint8_t *snapshot,
				       uint16_t snapshot_size,
				       struct tlsr8258_radio_data *radio)
{
	uint8_t *rx = radio->rx_proc;
	uint8_t *payload = &rx[TLSR8258_PAYLOAD_OFFSET];
	uint16_t rx_ack = irq_status & RF_IRQ_RX_EVENTS;
	uint16_t snapshot_len = 0u;
	uint16_t rx_dma_len;
	int8_t rx_rssi_dbm;
	/*
	 * Capture the RX-ISR-entry timestamp before any other work for diagnostics.
	 * The ACK turnaround timestamp is captured separately, immediately after
	 * switching to TX mode, matching vendor mac_phy.c.
	 */
	uint32_t isr_entry_cycles = k_cycle_get_32();
	if (radio->debug != NULL) {
		radio->debug->isr_entry_cyc = isr_entry_cycles;
	}
	if (rx_ack == 0u) {
		rx_ack = RF_IRQ_RX;
	}
	TLSR_REG16(0x0f20) = rx_ack;
	tlsr8258_radio_rx_count_inc(radio);

	/*
	 * Vendor mac_phy.c rf_rx_irq_handler drops CRC-fail / length-inconsistent
	 * frames HERE — before the address filter, MAC-ACK, or PSDU parse:
	 *   if ((!ZB_RADIO_CRC_OK(p)) || (!ZB_RADIO_PACKET_LENGTH_OK(p)) ...) {
	 *       ZB_RADIO_RX_BUF_CLEAR(rf_rxBuf); ZB_RADIO_RX_ENABLE; return; }
	 * On a busy channel the radio DMAs noise/collisions as frames with a garbage
	 * length byte (RTT: "RX sink rejected invalid frame len=146/226/242"). This
	 * guard MUST precede dma_payload_len_get()/rx_ack_decision() below: a garbage
	 * rx[0]/rx[4] otherwise yields a bogus `length` (up to ~250) so the PSDU parse
	 * reads several bytes past the DMA buffer into the adjacent rx_shadow AND — the
	 * real hazard — we would MAC-ACK and run the AssocResp filter-handoff on pure
	 * noise. Re-arm RX and drop, exactly as the vendor does. rx_active/rx_proc were
	 * already swapped by the caller, so the DMA stays armed for the next frame.
	 */
	if (!tlsr8258_rx_length_ok(rx)) {
		tlsr8258_rf_set_rxmode_vendor();
		return;
	}
	if (!tlsr8258_rx_crc_ok(rx)) {
		/* The 8258 RF RX latch is CRC-gated.  With the TB03F active
		 * 0x0f03 profile, the trailer/status byte does not match the old
		 * vendor macro even though RF_IRQ_RX is asserted and the frame is
		 * successfully ACKed.  Treat the hardware RX event as authoritative;
		 * only a CRC2-only event is a real CRC failure. */
		if ((irq_status & RF_IRQ_RX) == 0u) {
			tlsr8258_rf_set_rxmode_vendor();
			return;
		}
	}

	uint8_t length = tlsr8258_dma_payload_len_get(rx, (uint16_t)rx[0] + 4u);
	uint32_t ack_prepared_at_cycles = 0u;
	bool ack_mode_prepared = false;
	bool ack_requested_early = tlsr8258_ack_requested(payload, length);

	/* Match zigbee-rs take_completed_rx(): leave RX and enter TX before any
	 * header/debug/filter work.  AssocResp is only valid for a very short ACK
	 * turnaround window; doing this below the parser made the ACK intermittent
	 * and the coordinator retransmit the response. */
	if (ack_requested_early) {
		tlsr8258_rf_set_txmode_for_ack();
		ack_prepared_at_cycles = k_cycle_get_32();
		ack_mode_prepared = true;
	}
	struct tlsr8258_core_filter_ctx ack_filter_ctx = {
		.pan_id = radio->filter_pan_id,
		.short_addr = radio->filter_short_addr,
		.ieee_addr = radio->filter_ieee_addr,
	};
	struct tlsr8258_core_rx_ack_decision ack_decision;

	/*
	 * Shared with the tlsr8258_rx_ack_decision host unit test (fake_phy_core.h)
	 * so the ISR's self-originated / ack-request / should-ACK decision is
	 * exercised deterministically off-hardware.
	 */
	tlsr8258_core_rx_ack_decision(payload, length, &ack_filter_ctx, &ack_decision);
	bool self_originated = ack_decision.self_originated;
	bool ack_requested = ack_decision.ack_requested;

	if (self_originated) {
		tlsr8258_rf_set_rxmode_vendor();
		if (radio->debug != NULL) {
			radio->debug->rx_capture_debug_count++;
			radio->debug->rx_capture_irq_debug = irq_status;
			radio->debug->rf_irq_ack_debug = rx_ack;
		}
		return;
	}

	/*
	 * MAC ACK transmission, hybrid vendor pattern.  TLSR8258 will not drive
	 * the antenna from tx_pkt while the TRX state register sits in RX mode
	 * (the DMA fires but no frame appears on air), so the lightweight
	 * tlsr8258_rf_set_txmode_for_ack() is called first; it skips the
	 * PLL/channel reload, so the state transition is only ~5us. The
	 * ack_requested flag was decided once above; do NOT re-check inside
	 * tlsr8258_send_ack_if_needed() (the second look-up adds a redundant
	 * PSDU access on every RX while we are racing the coordinator's
	 * aTurnaroundTime window).
	 */
	if (ack_requested) {
		if (!ack_mode_prepared) {
			tlsr8258_rf_set_txmode_for_ack();
			ack_prepared_at_cycles = k_cycle_get_32();
		}
		if (radio->debug != NULL) {
			radio->debug->ack_capture_cyc = ack_prepared_at_cycles;
			uint32_t delta =
				(ack_prepared_at_cycles - isr_entry_cycles) /
				(CONFIG_SYS_CLOCK_HW_CYCLES_PER_SEC / 1000000u);
			radio->debug->isr_to_capture_us =
				(uint16_t)((delta > 0xffffu) ? 0xffffu : delta);
		}
		tlsr8258_send_ack_if_needed(payload, length, true,
					    ack_prepared_at_cycles, isr_entry_cycles, radio);
	}

	/* The Zigbee sink bypasses Zephyr's net-stack receive path, so the
	 * ordinary tlsr8258_filter_match() in rx_dispatch() is not reached there.
	 * Apply the same PAN/address filter before consuming one of the 16 deferred
	 * RX slots. Otherwise broadcasts and unrelated unicast traffic can fill the
	 * FIFO while the ISR still emits MAC ACKs, leaving the coordinator's next
	 * interview request ACKed but never delivered to the stack. Keep ACK frames
	 * only while a stack TX is waiting for that ACK; idle ACKs have no Zigbee
	 * payload and only waste a deferred slot. */
	if ((payload[TLSR8258_FRAME_TYPE_OFFSET] & 0x07u) == 0x02u) {
		if ((radio->op.state != TLSR8258_RADIO_OP_TX_PENDING) &&
		    (radio->op.state != TLSR8258_RADIO_OP_WAITING_POST_TX_RX)) {
			tlsr8258_rf_set_rxmode_vendor();
			return;
		}
	} else if (tlsr8258_zigbee_rx_sink != NULL) {
		/* RAW_MODE only selects the Zephyr L2 delivery ABI.  Once the
		 * Zigbee sink is installed, retain the normal address filter so
		 * broadcast traffic and unrelated unicast traffic cannot fill the
		 * ISR-to-Zigbee queue and evict join/interview frames. */
		if (!tlsr8258_filter_match(radio, payload) &&
		    !tlsr8258_assoc_resp_for_us(radio, payload, length)) {
			tlsr8258_rf_set_rxmode_vendor();
			return;
		}
	} else {
#if !defined(CONFIG_IEEE802154_RAW_MODE)
		if (!tlsr8258_filter_match(radio, payload) &&
		    !tlsr8258_assoc_resp_for_us(radio, payload, length)) {
			tlsr8258_rf_set_rxmode_vendor();
			return;
		}
#endif
	}

