devbis/zephyr-tlsr8258/drivers/ieee802154/ieee802154_tlsr8258.c
	/*
	 * Early radio-filter handoff (Zigbee join fix). The coordinator sends its
	 * Transport-Key burst to our freshly-assigned short within a few ms of the
	 * ASSOCIATION-RESPONSE — before the stack-side fast-handoff runs — so program
	 * the assigned short (and PAN) into the filter the instant we RX a SUCCESS
	 * AssocResp addressed to our IEEE, so the Transport-Key frames are ACKed
	 * straight from this ISR.
	 *
	 * Done AFTER the ACK is on air, not before: this parse (mac_hdr_size +
	 * 8-byte memcmp) sits between the RX-ISR-entry timestamp the ACK turnaround
	 * is measured from and the ACK transmission, so running it first delayed our
	 * MAC-ACK of the (large dual-IEEE) AssocResp past the coordinator's
	 * aTurnaroundTime window — the coord then never saw our ACK, retransmitted
	 * the AssocResp, and gave up without sending the Transport-Key. The filter
	 * update is only needed for the Transport-Key that arrives ~ms later, so it
	 * is safe to defer to just after the ACK.
	 */
	if (((payload[TLSR8258_FRAME_TYPE_OFFSET] & 0x07u) == 0x03u) &&
	    ((payload[TLSR8258_DEST_ADDR_TYPE_OFFSET] & TLSR8258_DEST_ADDR_TYPE_MASK) ==
	     TLSR8258_DEST_ADDR_TYPE_IEEE)) {
		uint16_t arsp_fcf = sys_get_le16(payload);
		uint8_t arsp_hdr = tlsr8258_mac_hdr_size(arsp_fcf, length);

		if ((arsp_hdr != 0u) && ((uint16_t)(arsp_hdr + 4u) <= length) &&
		    (payload[arsp_hdr] == 0x02u) &&        /* MAC_CMD_ASSOCIATION_RESPONSE */
		    (payload[arsp_hdr + 3u] == 0x00u) &&   /* MAC_SUCCESS */
		    (memcmp(&payload[TLSR8258_DEST_ADDR_OFFSET], radio->filter_ieee_addr,
			    TLSR8258_IEEE_ADDR_SIZE) == 0)) {
			radio->filter_pan_id[0] = payload[TLSR8258_PAN_ID_OFFSET];
			radio->filter_pan_id[1] = payload[TLSR8258_PAN_ID_OFFSET + 1u];
			radio->filter_short_addr[0] = payload[arsp_hdr + 1u];
			radio->filter_short_addr[1] = payload[arsp_hdr + 2u];
		}
	}

	/*
	 * Debug bookkeeping deferred until after the ACK is on air. Same
	 * principle as in send_ack_if_needed: nothing in the busy-wait /
	 * tx-kick window should touch debug RAM.
	 */
	if (radio->debug != NULL) {
		radio->debug->rx_capture_debug_count++;
		radio->debug->rx_capture_irq_debug = irq_status;
		radio->debug->rf_irq_ack_debug = rx_ack;
	}

	if ((snapshot != NULL) && (snapshot_size > 0u)) {
		snapshot_len = tlsr8258_snapshot_rx_frame(radio, snapshot, snapshot_size);
		if (snapshot_len >= TLSR8258_PAYLOAD_OFFSET) {
			rx = snapshot;
			payload = &rx[TLSR8258_PAYLOAD_OFFSET];
			length = tlsr8258_dma_payload_len_get(rx, snapshot_len);
		}
	}

	rx_rssi_dbm = tlsr8258_rx_rssi_dbm(rx);
	rx_dma_len = (snapshot_len >= TLSR8258_PAYLOAD_OFFSET) ? snapshot_len : (uint16_t)rx[0] + 4u;
	rx_dma_len = MIN(rx_dma_len, UINT8_MAX);
	(void)tlsr8258_rx_queue_try_enqueue(&radio->rx_queue, rx, (uint8_t)rx_dma_len,
					    rx_rssi_dbm);
}

/* Keep the worker-side sink handoff as a real call boundary. */
__attribute__((noinline))
static void tlsr8258_rx_dispatch(struct tlsr8258_radio_data *radio,
				 const struct tlsr8258_rx_frame *frame)
{
	const uint8_t *rx = frame->dma;
	struct tlsr8258_rx_frame_view view;
	int rc;
#if !defined(CONFIG_IEEE802154_RAW_MODE)
	uint8_t length;
	int8_t rssi;
	struct net_pkt *pkt;
#endif

	if (tlsr8258_zigbee_rx_sink != NULL) {
		view.dma = rx;
		view.len = frame->len;
		view.rssi_dbm = frame->rssi_dbm;
		rc = tlsr8258_zigbee_rx_sink(&view);
		if (rc < 0) {
			if (rc == -ENODATA) {
				LOG_DBG("zigbee RX sink deferred frame handling (len=%u)", frame->len);
			} else {
				LOG_WRN("zigbee RX sink rejected frame (rc=%d len=%u)", rc, frame->len);
			}
		}
		return;
	}

#if defined(CONFIG_IEEE802154_RAW_MODE)
	ARG_UNUSED(rx);
#else
	if (radio->iface == NULL || !tlsr8258_rx_length_ok(rx) || !tlsr8258_rx_crc_ok(rx)) {
		return;
	}

	length = rx[4];
	if (!IS_ENABLED(CONFIG_IEEE802154_L2_PKT_INCL_FCS)) {
		if (length <= TLSR8258_FCS_LENGTH) {
			return;
		}
		length -= TLSR8258_FCS_LENGTH;
	}

	if (length < TLSR8258_MIN_FRAME_LENGTH || length > TLSR8258_PHY_MAX_PSDU) {
		return;
	}

	if (!tlsr8258_filter_match(radio, (uint8_t *)&rx[TLSR8258_PAYLOAD_OFFSET]) &&
	    !tlsr8258_assoc_resp_for_us(radio, (uint8_t *)&rx[TLSR8258_PAYLOAD_OFFSET],
					 length)) {
		return;
	}

	pkt = net_pkt_rx_alloc_with_buffer(radio->iface, length, NET_AF_UNSPEC, 0,
					   K_NO_WAIT);
	if (pkt == NULL) {
		return;
	}

	if (net_pkt_write(pkt, &rx[TLSR8258_PAYLOAD_OFFSET], length) < 0) {
		net_pkt_unref(pkt);
		return;
	}

	rssi = frame->rssi_dbm;
	net_pkt_set_ieee802154_rssi_dbm(pkt, rssi);
	net_pkt_set_ieee802154_lqi(pkt, tlsr8258_lqi_from_rssi(rssi));

	if (net_recv_data(radio->iface, pkt) < 0) {
		net_pkt_unref(pkt);
	}
#endif
}

/*
 * Drain rx_queue from the ZB thread (see zb_platform_radio_rx_poll). This is
 * the SOLE RX consumer: there is deliberately no separate COOP RX worker
 * thread, because the zb_thread no-yield busy-loop (zb_main.c:390)
 * intermittently starves a cooperative worker — on some boots it never
 * dequeues a frame, so RX (AssocResp / Transport-Key / interview) silently
 * stalls and the router re-associates forever. Single-consumer here (zb_thread
 * only) removes BOTH the starvation and the zb_buf-pool data race a second
 * concurrent consumer would cause. TX/ACK completion is independent — handled
 * directly in tlsr8258_rf_isr (k_sem_give tx_wait on WAITING_POST_TX_RX) — so
 * it is unaffected.
 */
static void tlsr8258_rx_drain_pending(struct tlsr8258_radio_data *radio)
{
	struct tlsr8258_rx_frame frame;

	while (tlsr8258_rx_queue_try_dequeue(&radio->rx_queue, &frame)) {
		bool is_ack = false;
		bool ack_pending = false;
		bool is_pending_response = false;

		if (frame.len >= TLSR8258_PAYLOAD_OFFSET) {
			const uint8_t *psdu = &frame.dma[TLSR8258_PAYLOAD_OFFSET];
			uint8_t psdu_len = tlsr8258_dma_payload_len_get(frame.dma, frame.len);
			uint8_t tx_seq = radio->op.tx_seq;

			is_ack = tlsr8258_psdu_is_ack_for_seq(psdu, psdu_len, tx_seq);
			ack_pending = is_ack && ((psdu[0] & TLSR8258_FRAME_PENDING) != 0u);
			is_pending_response =
				tlsr8258_psdu_is_pending_response(psdu, psdu_len, tx_seq, radio);
		}

