devbis/zephyr-tlsr8258/drivers/ieee802154/ieee802154_tlsr8258.c
		tlsr8258_rx_dispatch(radio, &frame);
		tlsr8258_rx_queue_release(&radio->rx_queue, frame.slot);

		{
			bool rx_complete;
			uint32_t key = irq_lock();

			rx_complete = (radio->op.state == TLSR8258_RADIO_OP_WAITING_POST_TX_RX) &&
				      tlsr8258_radio_op_on_rx(&radio->op, is_ack, ack_pending,
							      is_pending_response);
			irq_unlock(key);
			if (rx_complete) {
				k_sem_give(&radio->tx_wait);
			}
		}
	}
}

static void tlsr8258_rx_capture_isr(uint16_t irq_status, struct tlsr8258_radio_data *radio)
{
	tlsr8258_rx_capture_common(irq_status, NULL, 0u, radio);
}

/*
 * Vendor-pattern .ram_code placement. Symbol stays at a FLASH address but
 * sits inside the icache-locked low-flash window configured by reset.S
 * SET_IC, so every instruction fetch in the RF IRQ handler is a 1-cycle
 * cache hit instead of a multi-cycle XIP miss.  No SRAM copy, no veneer
 * thunks, no _sw_isr_table timing window.
 */
__attribute__((section(".ram_code")))
static void tlsr8258_rf_isr(const void *arg)
{
	/*
	 * Capture the ISR-entry cycle counter as the very first instruction so
	 * that downstream latency measurements (rx_capture_common timestamp,
	 * busy_wait entry, tx kick, tx done) all have a common t=0 reference.
	 * Stashed in a local because radio->debug is dereferenced through dev
	 * a few instructions later; using a local first keeps the measurement
	 * stable even if the compiler reorders the prologue.
	 */
	uint32_t isr_entry_cyc = k_cycle_get_32();
	struct tlsr8258_radio_data *radio = (struct tlsr8258_radio_data *)arg;
	uint16_t irq = TLSR_REG16(0x0f20);
	/* On this silicon the RF RX latch can vector before DMA2 has written
	 * the length byte and trailer.  Do not swap/re-arm the active buffer in
	 * that window: doing so discards the just-received long unicast (most
	 * visibly the indirect Association Response).  A valid frame normally
	 * becomes coherent immediately; the bounded wait is only on the invalid
	 * transient path and remains inside the MAC ACK deadline. */
	if ((irq & RF_IRQ_RX_EVENTS) != 0u &&
	    (!tlsr8258_rx_length_ok(radio->rx_active) ||
	     !tlsr8258_rx_crc_ok(radio->rx_active))) {
		for (uint32_t spin = 0u; spin < 40u; spin++) {
			if (tlsr8258_rx_length_ok(radio->rx_active) &&
			    tlsr8258_rx_crc_ok(radio->rx_active)) {
				break;
			}
			k_busy_wait(1u);
		}
	}
	uint16_t effective_irq =
		tlsr8258_rf_irq_effective_status(irq, radio->rx_active, TLSR8258_RX_BUF_SIZE);
	uint8_t dma_len = radio->rx_active[0];
	uint8_t crc = 0u;
	struct tlsr8258_radio_debug *debug = radio->debug;
	bool has_rx = tlsr8258_rf_irq_has_rx_event(effective_irq);
	bool has_tx = (effective_irq & (RF_IRQ_TX | RF_IRQ_TX_DS)) != 0u;

	if (debug != NULL) {
		uint32_t prev = debug->prev_isr_entry_cyc;
		uint32_t gap_us = (isr_entry_cyc - prev) /
				  (CONFIG_SYS_CLOCK_HW_CYCLES_PER_SEC / 1000000u);

		debug->isr_entry_cyc = isr_entry_cyc;
		debug->prev_isr_entry_cyc = isr_entry_cyc;
		if (prev != 0u) {
			debug->inter_isr_gap_us = gap_us;
			if (gap_us > debug->inter_isr_gap_max_us) {
				debug->inter_isr_gap_max_us = gap_us;
			}
		}
		debug->rf_isr_entry_count++;
		debug->rf_irq_raw_debug = irq;
		debug->rf_irq_effective_debug = effective_irq;
		debug->rf_irq_mask_debug = TLSR_REG16(0x0f1c);
		debug->rf_dma_len_debug = dma_len;
		debug->rf_psdu_len_debug = radio->rx_active[4];
		/*
		 * NOTE: reading registers 0x0f00, 0x0f02, 0x0428, 0x0430 inside
		 * the RF ISR triggered a chip hang in testing — the device sent
		 * exactly one BeaconReq and then stopped responding to RF and to
		 * SWire.  Some of these RF control registers must have read-side
		 * effects on the TLSR8258 state machine, so we skip the snapshot.
		 * If we need to inspect chip state later, do it outside the ISR
		 * (e.g. from a periodic timer in the main thread).
		 */
	}
	if ((dma_len != 0u) && (dma_len < (TLSR8258_RX_BUF_SIZE - 3u))) {
		crc = radio->rx_active[dma_len + 3u];
	}
	if (debug != NULL) {
		debug->rf_crc_debug = crc;
	}
	tlsr8258_radio_last_irq_set(radio, effective_irq);

	/*
	 * LEVEL-IRQ SAFETY: if the raw IRQ carried an RX-class bit but
	 * tlsr8258_rf_irq_effective_status() dropped it (invalid/transient DMA
	 * frame — !dma_valid && !dma_sane), then has_rx is false and none of the
	 * branches below clear those raw RX bits. ZB_RT (the RF IRQ) is
	 * level-triggered, so an uncleared RX bit keeps the interrupt asserted
	 * and the ISR re-fires forever — starving the ZB thread (observed as the
	 * post-join freeze: nested==1, reg_irq_src bit13 set, rf_irq 0xf20=RX).
	 * Clear the dropped RX bits here so the level can deassert.
	 */
	if (!has_rx && (irq & RF_IRQ_RX_EVENTS) != 0u) {
		TLSR_REG16(0x0f20) = RF_IRQ_RX_EVENTS;
		/* A raw RX completion can be transient/invalid before the DMA header
		 * is coherent.  Clearing only RF_IRQ_RX leaves DMA2 in its completed
		 * state and makes this the last ISR forever.  zigbee-rs still consumes
		 * that completion through take_completed_rx(), which clears DMA2 and
		 * arms the next buffer; mirror that behavior here. */
		radio->rx_active[0] = 0u;
		radio->rx_active[4] = 0u;
		tlsr8258_rf_rx_buffer_set(radio->rx_active, TLSR8258_RX_DMA_SIZE);
		tlsr8258_rf_set_rxmode_vendor();
		if (debug != NULL) {
			debug->rf_irq_ack_debug = RF_IRQ_RX_EVENTS;
		}
	}

	/*
	 * Handle TX completion before RX when both bits are asserted in the same
	 * ISR.  Data Request polling can receive the ACK/pending frame quickly
	 * enough that hardware reports a combined TX+RX event; if RX wins, the
	 * radio-op remains TX_PENDING and tx() times out even though the frame was
	 * received and delivered asynchronously.
	 */
	if (has_tx) {
		bool tx_complete;
		uint32_t key;
		bool ack_tx_completion;
		struct tlsr8258_core_tx_done_result tx_done_result;

		if (debug != NULL) {
			debug->rf_branch_debug = has_rx ? 6u : 2u;
			debug->rf_irq_ack_debug = effective_irq & (RF_IRQ_TX | RF_IRQ_TX_DS);
		}
		tlsr8258_rf_tx_status_clear();
		TLSR_REG16(0x0f20) = effective_irq & (RF_IRQ_TX | RF_IRQ_TX_DS);
		tlsr8258_radio_tx_count_inc(radio);
		{
			tlsr8258_core_handle_tx_done(effective_irq & (RF_IRQ_TX | RF_IRQ_TX_DS),
						      has_rx, radio->op.ack_tx_pending,
						      radio->op.expect_post_tx_rx,
						      radio->op.state == TLSR8258_RADIO_OP_TX_PENDING,
						      &tx_done_result);

			if (tx_done_result.enter_rx_fast) {
			bool poll_followup =
				tlsr8258_core_psdu_expects_post_tx_followup(
					&radio->tx_buffer[TLSR8258_PAYLOAD_OFFSET],
					radio->tx_buffer[4] - TLSR8258_FCS_LENGTH) &&
				!has_rx;

