devbis/zephyr-tlsr8258/drivers/ieee802154/ieee802154_tlsr8258.c
			/*
			 * Post-TX return to RX, mirroring the vendor rf_rx_irq_handler
			 * ORDER: (1) switch to RX mode, then (2) re-point the RX buffer and
			 * re-enable the RX DMA channel LAST. ([80] proved our poll completes
			 * as plain RF_IRQ_TX, not TX_DS — the HW does NOT auto-consume the
			 * ACK — so the coordinator's ACK+AssocResp arrive as ordinary RX
			 * ~200us-13ms later and the radio must be cleanly listening by then.)
			 * Order: re-point the RX buffer + re-arm the RX DMA channel, THEN
			 * switch to RX mode (the config that produced the first-ever
			 * AssocResp reception + ACK; the reverse order regressed to 0
			 * handoffs on HW).
			 */
				if (tx_done_result.rearm_rx_buffer) {
					radio->rx_active =
						tlsr8258_core_next_rx_buffer(radio->rx_active,
									      radio->rx_buffer,
									      radio->rx_shadow);
					radio->rx_active[0] = 0u;
					radio->rx_active[4] = 0u;
					tlsr8258_rf_rx_buffer_set(radio->rx_active,
								  TLSR8258_RX_BUF_SIZE);
				}
				if (poll_followup) {
					tlsr8258_rf_set_rxmode_vendor();
				} else {
					/*
					 * Post-TX (including MAC-ACK completion) return to
					 * RX. Use the vendor no-reset turnaround rather than
					 * set_rxmode_fast(): _fast still writes
					 * 0x0f02 = RF_TRX_OFF first (the TX/RX state-machine
					 * reset), which leaves the radio deaf for
					 * ~200us-13ms. After we MAC-ACK a frame addressed to
					 * us, that deaf window drops the coordinator's very
					 * next frame to us (the Transport-Key burst and the
					 * post-join ZDP interview requests), so those unicasts
					 * are never received. Switching to the vendor-exact
					 * TX-en -> RX-en turnaround (no reset, no PLL reload)
					 * measured ~8x more of our unicasts ACKed on HW. Same
					 * root cause as the assoc-poll fix (commit dd3854ab),
					 * which only covered the poll_followup path above.
					 */
					tlsr8258_rf_set_rxmode_vendor();
				}
			}
		}
		key = irq_lock();
		/*
		 * Step 2 — if this TX completion is for the MAC ACK we kicked
		 * inside the previous RF ISR, just clear the pending flag and
		 * skip the stack-TX state machine (the op state is not
		 * TX_PENDING for ACK transmissions, but we still want to make
		 * absolutely sure tx_wait doesn't get a stray give and that
		 * op_on_tx_success doesn't reset state on an ack-only TX).
		 */
		ack_tx_completion = tx_done_result.count_ack_tx_completion;
		if (tx_done_result.clear_ack_tx_pending) {
			radio->op.ack_tx_pending = false;
		}
		tx_complete = tx_done_result.complete_stack_tx &&
			      tlsr8258_radio_op_on_tx_success(&radio->op);
		irq_unlock(key);
		if (tx_complete) {
			k_sem_give(&radio->tx_wait);
		}
	}

	if (has_rx) {
		uint8_t rx_pass;

		/*
		 * Match the updated zigbee-rs always-RX vector: a second packet can
		 * complete while the first one is being ACKed/copied.  Drain only a
		 * bounded pair here; if the latch is still asserted afterward, leave
		 * it pending for the next CPU vector instead of spinning in the ISR.
		 */
		for (rx_pass = 0u; rx_pass < 2u; rx_pass++) {
			struct tlsr8258_core_rx_dma_result rx_dma_result;

			if (rx_pass != 0u) {
				irq = TLSR_REG16(0x0f20);
				effective_irq = tlsr8258_rf_irq_effective_status(
					irq, radio->rx_active, TLSR8258_RX_BUF_SIZE);
				if (!tlsr8258_rf_irq_has_rx_event(effective_irq)) {
					break;
				}
			}

		if (debug != NULL) {
				debug->rf_branch_debug = has_tx ? 7u : 1u;
				debug->rf_isr_rx_event_count++;
			}
			/*
			 * Double-buffer swap (vendor mac_phy.c rf_rx_irq_handler): the RF DMA
			 * just filled rx_active. Hand that buffer to rx_proc for processing and
			 * point the DMA at the OTHER of {rx_buffer, rx_shadow} BEFORE parsing or
			 * ACKing, so the next frame lands in a fresh buffer.
			 */
			tlsr8258_core_handle_rx_dma(radio->rx_active, radio->rx_buffer,
							radio->rx_shadow, &rx_dma_result);
			radio->rx_proc = rx_dma_result.rx_proc;
			radio->rx_active = rx_dma_result.next_rx_active;
			if (rx_dma_result.rearm_rx_buffer) {
				/*
				 * Keep DMA2 disabled while rx_capture_common() performs
				 * the MAC-ACK/parse/queue handoff.  Re-enabling it before
				 * clearing the current RF completion lets this TLSR8258
				 * latch the same completion again; on hardware that becomes
				 * an ISR storm (thousands of dispatches for one frame) and
				 * starves the actual Zigbee traffic.  The vendor path updates
				 * the next address first and enables RX only after consuming
				 * the completed buffer.
				 */
				radio->rx_active[0] = 0u;
				radio->rx_active[4] = 0u;
				TLSR_REG8(0x0c20) &= (uint8_t)~DMA_CHN_RF_RX;
			}

			tlsr8258_rx_capture_isr(effective_irq, radio);
			if (rx_dma_result.rearm_rx_buffer) {
				tlsr8258_rf_rx_buffer_set(radio->rx_active, TLSR8258_RX_BUF_SIZE);
				/* A MAC ACK is kicked from rx_capture_common() and its
				 * TX-done ISR owns the TX->RX transition.  Do not switch
				 * the RF state machine underneath that pending ACK. */
				if (!radio->op.ack_tx_pending) {
					tlsr8258_rf_set_rxmode_vendor();
				}
			}
		}
		if (has_tx) {
			uint16_t residual_irq =
				effective_irq & ~(RF_IRQ_TX | RF_IRQ_TX_DS | RF_IRQ_RX_EVENTS);

			if (residual_irq != 0u) {
				TLSR_REG16(0x0f20) = residual_irq;
			}
		} else if (radio->op.state == TLSR8258_RADIO_OP_TX_PENDING) {
			/*
			 * Some TX completions on this chip arrive as RX_EVENT only (the
			 * MAC ACK reception that auto-follows a frame with the ACK_REQUEST
			 * bit set), with neither RF_IRQ_TX nor RF_IRQ_TX_DS asserted in the
			 * same ISR.  The RX event is not, by itself, proof of TX completion:
			 * a coordinator retry or an unrelated beacon can arrive while our
			 * TX is pending.  Complete only when the completed DMA buffer is the
			 * MAC ACK for the exact sequence number of this TX.
			 */
			bool tx_complete;
			uint32_t key;
			struct tlsr8258_core_rx_only_tx_result rx_only_tx_result;
			bool ack_for_tx = false;

			if (radio->op.expect_ack && radio->rx_proc != NULL) {
				const uint8_t *psdu = &radio->rx_proc[TLSR8258_PAYLOAD_OFFSET];
				uint8_t psdu_len = tlsr8258_dma_payload_len_get(
					radio->rx_proc, radio->rx_proc[0] + 4u);

