devbis/zephyr-tlsr8258/drivers/ieee802154/ieee802154_tlsr8258.c
				ack_for_tx = tlsr8258_psdu_is_ack_for_seq(psdu, psdu_len,
									radio->op.tx_seq);
			}

			tlsr8258_core_handle_rx_only_tx_completion(false,
									 radio->op.state ==
										 TLSR8258_RADIO_OP_TX_PENDING,
									 ack_for_tx,
									 &rx_only_tx_result);
			key = irq_lock();
			tx_complete = rx_only_tx_result.complete_stack_tx &&
				      tlsr8258_radio_op_on_tx_success(&radio->op);
			irq_unlock(key);
			if (tx_complete) {
				k_sem_give(&radio->tx_wait);
			}
			/*
			 * Our ack-requested poll completed via its ACK arriving as an
			 * RX event only (no RF_IRQ_TX), so the has_tx TX->RX turnaround
			 * above never ran and the RX state machine was left un-re-armed.
			 * The coordinator's ASSOCIATION-RESPONSE (indirect, to our
			 * not-yet-short IEEE) follows only ~260us later; without a
			 * reset-free re-arm here the radio is not listening and the reply
			 * is lost (confirmed: AssocResp on air, 0 reach rx_capture_common).
			 * Mirror the has_tx branch's reset-free re-arm so the reply lands.
			 */
			tlsr8258_rf_set_rxmode_vendor();
		}
	} else if (!has_tx && (effective_irq & (RF_IRQ_STX_TIMEOUT | RF_IRQ_FSM_TIMEOUT)) != 0u) {
		bool tx_failed = false;
		uint32_t key;

		if (debug != NULL) {
			debug->rf_branch_debug = 3u;
			debug->rf_irq_ack_debug = effective_irq;
		}
		TLSR_REG16(0x0f20) = effective_irq;
		tlsr8258_rf_rearm_idle_rx(radio);
		key = irq_lock();
		if (radio->op.state == TLSR8258_RADIO_OP_TX_PENDING ||
		    radio->op.state == TLSR8258_RADIO_OP_WAITING_POST_TX_RX) {
			tlsr8258_radio_op_on_tx_error(&radio->op, -EIO);
			tx_failed = true;
		}
		irq_unlock(key);
			if (tx_failed) {
				k_sem_give(&radio->tx_wait);
			}
		} else {
			uint16_t ack = effective_irq != 0u ? effective_irq : RF_IRQ_ALL;

			if (has_tx) {
				ack &= ~(RF_IRQ_TX | RF_IRQ_TX_DS);
			}
				if (ack == 0u) {
					goto irq_reenable;
				}

			if (debug != NULL && !has_tx) {
				debug->rf_branch_debug = (effective_irq != 0u) ? 4u : 5u;
				debug->rf_irq_ack_debug = ack;
			}
		TLSR_REG16(0x0f20) = ack;
	}

	/*
	 * TLSR8258 clears the global IRQ-enable latch on entry to the RF
	 * interrupt.  The Rust/vendor IRQ vector explicitly sets it again before
	 * returning; without the matching re-enable here the first RF event is
	 * handled, then no further RX/TX interrupt can arrive.  That presents as
	 * an idle-deaf radio (0x0f02 falls back to RF_TRX_OFF) and also prevents
	 * the MAC-ACK path from keeping the coordinator's retry window alive.
	 */
irq_reenable:
	(void)tlsr8258_rf_recover_stuck_rx(radio);
	tlsr8258_rf_irq_reenable();
}

static void tlsr8258_iface_init(struct net_if *iface)
{
	const struct device *dev = net_if_get_device(iface);
	struct tlsr8258_radio_data *radio = dev->data;
	uint8_t *mac = radio->mac_addr;
	const uint8_t *runtime_ieee = zb_platform_runtime_ieee_addr_get();

#if defined(CONFIG_IEEE802154_TLSR8258_RANDOM_MAC)
		sys_rand_get(mac, TLSR8258_IEEE_ADDR_SIZE);
		mac[0] = (mac[0] & (uint8_t)~BIT(0)) | BIT(1);
#else
		if (runtime_ieee != NULL) {
			memcpy(mac, runtime_ieee, TLSR8258_IEEE_ADDR_SIZE);
		} else {
			mac[0] = 0xc4;
			mac[1] = 0x19;
			mac[2] = 0xd1;
			mac[3] = 0x00;
			mac[4] = CONFIG_IEEE802154_TLSR8258_MAC4;
			mac[5] = CONFIG_IEEE802154_TLSR8258_MAC5;
			mac[6] = CONFIG_IEEE802154_TLSR8258_MAC6;
			mac[7] = CONFIG_IEEE802154_TLSR8258_MAC7;
		}
#endif

	net_if_set_link_addr(iface, mac, TLSR8258_IEEE_ADDR_SIZE, NET_LINK_IEEE802154);
	memcpy(radio->filter_ieee_addr, mac, TLSR8258_IEEE_ADDR_SIZE);
	radio->iface = iface;
	ieee802154_init(iface);
}

static enum ieee802154_hw_caps tlsr8258_get_capabilities(const struct device *dev)
{
	ARG_UNUSED(dev);

	return IEEE802154_HW_FCS | IEEE802154_HW_FILTER | IEEE802154_HW_RX_TX_ACK;
}

static int tlsr8258_cca(const struct device *dev)
{
	struct tlsr8258_radio_data *radio = dev->data;

	if (!tlsr8258_radio_started_get(radio)) {
		return -ENETDOWN;
	}

	return ((int8_t)TLSR_REG8(0x0441) - 110) < CONFIG_IEEE802154_TLSR8258_CCA_RSSI_THRESHOLD ?
		       0 :
		       -EBUSY;
}

static int tlsr8258_set_channel(const struct device *dev, uint16_t channel)
{
	struct tlsr8258_radio_data *radio = dev->data;

	if (channel < 11u || channel > 26u) {
		return -EINVAL;
	}

	/* Update the persistent shadow even when the live value already matches. */
	tlsr8258_channel_shadow = channel;

	if (tlsr8258_radio_current_channel_get(radio) == channel) {
		return -EALREADY;
	}

	tlsr8258_radio_current_channel_set(radio, channel);
	if (tlsr8258_radio_started_get(radio)) {
		tlsr8258_rf_set_channel(channel);
		/* Channel changes must return directly to RX.  The resetful helper
		 * creates the same idle-deaf window as the old TX->RX path. */
		tlsr8258_rf_set_rxmode_vendor();
	}

	return 0;
}

static int tlsr8258_filter(const struct device *dev, bool set,
			   enum ieee802154_filter_type type,
			   const struct ieee802154_filter *filter)
{
	struct tlsr8258_radio_data *radio = dev->data;

	if (!set || filter == NULL) {
		return -ENOTSUP;
	}

	if (type == IEEE802154_FILTER_TYPE_IEEE_ADDR) {
		memcpy(radio->filter_ieee_addr, filter->ieee_addr, TLSR8258_IEEE_ADDR_SIZE);
		return 0;
	}
	if (type == IEEE802154_FILTER_TYPE_SHORT_ADDR) {
		sys_put_le16(filter->short_addr, radio->filter_short_addr);
		return 0;
	}
	if (type == IEEE802154_FILTER_TYPE_PAN_ID) {
		sys_put_le16(filter->pan_id, radio->filter_pan_id);
		return 0;
	}

	return -ENOTSUP;
}

static int tlsr8258_set_txpower(const struct device *dev, int16_t dbm)
{
	ARG_UNUSED(dev);

	if (dbm >= 9) {
		tlsr8258_rf_set_power_level(rf_power_level_list[0]);
	} else if (dbm >= 3) {
		tlsr8258_rf_set_power_level(rf_power_level_list[19]);
	} else if (dbm >= 0) {
		tlsr8258_rf_set_power_level(rf_power_level_list[30]);
	} else {
		tlsr8258_rf_set_power_level(0xffu);
	}

	return 0;
}

static int tlsr8258_start(const struct device *dev)
{
	struct tlsr8258_radio_data *radio = dev->data;
	const uint16_t runtime_irq_mask =
		tlsr8258_rf_irq_runtime_mask() |
		RF_IRQ_STX_TIMEOUT | RF_IRQ_FSM_TIMEOUT;

	if (tlsr8258_radio_started_get(radio)) {
		return -EALREADY;
	}

	/* Full SDK/Rust PHY bring-up order. */
	TLSR_REG8(0x0f00) = 0x80u;
	TLSR_REG8(0x0f16) = 0x29u;
	TLSR_REG8(0x0428) = RF_TRX_MODE;
	TLSR_REG8(0x0f02) = RF_TRX_OFF;
	TLSR_REG8(0x0f01) = 0x3fu;
	TLSR_REG8(0x0f01) = 0u;
	TLSR_REG16(0x0f20) = RF_IRQ_ALL;
	TLSR_REG16(0x0f1c) = 0u;
	TLSR_REG8(0x0f15) = 0x10u;
	TLSR_REG16(0x0f04) = 149u;
	tlsr8258_rf_init();
	tlsr8258_rf_set_channel(tlsr8258_radio_current_channel_get(radio));

	/* Keep the TLSR8258 Zigbee receive profile that was validated by the
	 * Zephyr router interview on hardware.  Bit7 of 0x0405 is required by the
	 * 8258 RX access-code path for IEEE-unicast frames; without it the radio
	 * still receives beacons/broadcasts but drops the coordinator's long-
	 * addressed AssocResp before DMA2.  The active-session LL/settle values
	 * below are the matching vendor profile (0xf0/113), not the newer generic
	 * Rust PHY defaults (0x10/150) which are not interchangeable here.
	 */
	TLSR_REG8(0x0401) = 0u;
	TLSR_REG8(0x0404) &= (uint8_t)~BIT(5);
	TLSR_REG8(0x0405) = 0x84u;
	TLSR_REG8(0x0f15) = 0xf0u;
	TLSR_REG16(0x0f04) = 113u;
	TLSR_REG8(0x0f03) &= (uint8_t)~BIT(2);
	tlsr8258_rf_debug_reset(radio);
	radio->rx_active = radio->rx_buffer;
	radio->rx_proc = radio->rx_buffer;
	tlsr8258_rf_rx_buffer_set(radio->rx_active, TLSR8258_RX_DMA_SIZE);
	radio->rx_buffer[0] = 0u;
	radio->rx_buffer[4] = 0u;
	radio->rx_shadow[0] = 0u;
	radio->rx_shadow[4] = 0u;
	TLSR_REG8(0x0c20) |= DMA_CHN_RF_RX | DMA_CHN_RF_TX;
	/* 0 dBm (rf_power_level_list[30] = 0xa9). TX power is not the interview-
	 * reliability factor; use a clean standard 0 dBm. */
	tlsr8258_rf_set_power_level(rf_power_level_list[30]);
	TLSR_REG8(0x0c26) = 0x0cu;
	TLSR_REG8(0x0c21) = 0x04u;
	/* The vendor headers label bit 5 as BLE NESN-init and do not set it for
	 * Zigbee.  On this TB03F, however, the live PHY loses all MAC-ACK/RX
	 * activity after the idle handoff unless the RX latch is asserted here;
	 * the A/B test is unambiguous (0x1a: no ACK, 0x3a: ACK).  Keep this
	 * board-specific workaround until the underlying 8258 RF blob behaviour
	 * is replaceable.  Bit 2 remains cleared as in vendor rf_drv.h. */
	TLSR_REG8(0x0f03) |= BIT(5);
	TLSR_REG16(0x0f20) = RF_IRQ_ALL;
	TLSR_REG16(0x0f1c) = 0u;
	TLSR_REG16(0x0f1c) = runtime_irq_mask;
	TLSR_REG8(0x0430) |= BIT(1);
	/* Match zigbee-rs set_rx_mode(): no RF_TRX_OFF reset here.  The radio is
	 * already stopped by the ordered bring-up above; this is the first and
	 * only RX arm for the idle router. */
	tlsr8258_rf_set_rxmode_vendor();
	/* RF IRQ entry clears the global CPU gate on TLSR8258.  Use the same
	 * atomic mask/source/global restore as the updated zigbee-rs driver even
	 * for the initial RX arm; irq_enable() only changes REG_IRQ_MASK. */
	tlsr8258_rf_irq_reenable();
	tlsr8258_radio_started_set(radio, true);

