devbis/zephyr-tlsr8258/drivers/ieee802154/ieee802154_tlsr8258.c
	return 0;
}

static int tlsr8258_stop(const struct device *dev)
{
	struct tlsr8258_radio_data *radio = dev->data;

	if (!tlsr8258_radio_started_get(radio)) {
		return -EALREADY;
	}

	irq_disable(TLSR8258_IRQ_ZB_RT);
	TLSR_REG16(0x0f1c) = 0u;
	TLSR_REG16(0x0f20) = RF_IRQ_ALL;
	tlsr8258_rf_off();
	tlsr8258_radio_started_set(radio, false);

	return 0;
}

static int tlsr8258_set_tx_payload(struct tlsr8258_radio_data *radio, const uint8_t *payload,
				   uint8_t payload_len)
{
	uint8_t *tx_buffer;
	int ret;

	if (payload_len > (TLSR8258_PHY_MAX_PSDU - TLSR8258_FCS_LENGTH)) {
		return -EINVAL;
	}

	/* Keep multiple DMA-owned packets alive. The zigbee-rs reference uses a
	 * TX FIFO for the same reason: RF_IRQ_TX can complete before DMA3 has
	 * released the descriptor, while the next stack request is already
	 * preparing another encrypted frame. */
	tx_buffer = radio->tx_buffer;
	ret = tlsr8258_set_tx_payload_to(tx_buffer, payload, payload_len);

	return ret;
}

static int tlsr8258_set_tx_payload_to(uint8_t *tx_buffer, const uint8_t *payload,
					      uint8_t payload_len)
{
	uint32_t dma_len;

	if (payload_len > (TLSR8258_PHY_MAX_PSDU - TLSR8258_FCS_LENGTH)) {
		return -EINVAL;
	}

	/* MCU_CORE_8258's vendor path uses a raw DMA byte count here.  The
	 * rf_tx_packet_dma_len() word/remainder encoding belongs to B91/8278,
	 * not this 8258 RF block. */
	dma_len = (uint32_t)payload_len + 1u;
	tx_buffer[0] = (uint8_t)dma_len;
	tx_buffer[1] = (uint8_t)(dma_len >> 8);
	tx_buffer[2] = (uint8_t)(dma_len >> 16);
	tx_buffer[3] = (uint8_t)(dma_len >> 24);
	tx_buffer[4] = payload_len + TLSR8258_FCS_LENGTH;
	/* The DMA header makes the payload destination unaligned by five bytes.
	 * Use an explicit byte copy; the TC32 memcpy path can leave the final MIC
	 * byte stale on this boundary. */
	for (uint8_t i = 0U; i < payload_len; i++) {
		tx_buffer[TLSR8258_PAYLOAD_OFFSET + i] = payload[i];
	}
	return 0;
}

/*
 * TX-done busy-poll bound for the synchronous assoc-poll. A 16-byte DataReq at
 * 250 kbps is ~0.7 ms on air; 3 ms is a generous ceiling before we give up.
 */
#define TLSR8258_SYNC_POLL_TX_DONE_TIMEOUT_US 3000u
#define TLSR8258_SYNC_POLL_TX_DONE_STEP_US    20u

/*
 * Vendor-model synchronous path for frames followed by an immediate RX window.
 *
 * The async completion of this poll was non-deterministic: it finished either
 * via the RF ISR (fast, set_rxmode_vendor) OR — when the TX IRQ missed the ISR
 * — via the tx() status-poll fallback, which re-entered RX with the SLOW full
 * set_rxmode (channel reload + PLL relock). So the TX->RX turnaround timing
 * jittered run-to-run and was sometimes too slow, leaving the radio not
 * listening when a response lands. That variance can stall discovery and
 * association.
 *
 * Mirror the vendor rf_tx_irq_handler instead: with the RF ISR masked, kick the
 * poll, busy-poll for TX-done, then IMMEDIATELY re-arm the RX DMA buffer and
 * switch to RX via the vendor-exact set_rxmode (no reset, no PLL reload) — a
 * single deterministic fast turnaround every time. Re-enable the ISR so the
 * normal RX path receives follow-up frames. Beacon requests and ACK-requested
 * DataReq polls take this path; unrelated TX remains on the async path.
 */
static int tlsr8258_tx_sync_followup(struct tlsr8258_radio_data *radio, uint8_t tx_seq,
				     bool expect_ack)
{
	uint32_t waited_us = 0u;
	bool tx_done = false;

	/*
	 * Own the complete radio operation, including DMA2's CPU source.  The
	 * generic irq_disable() call only masked ZB_RT; an RX-DMA completion could
	 * otherwise vector in the middle of this handoff and consume the buffer
	 * while the poll still owns the RF state machine.  This is the same
	 * CPU_RX_IRQ_MASK critical section used by the current zigbee-rs PHY.
	 */
	TLSR_REG8(0x0643) = 0u;
	TLSR_REG32(0x0640) &= ~(BIT(4) | BIT(TLSR8258_IRQ_ZB_RT));
	compiler_barrier();
	tlsr8258_radio_op_prepare_tx(&radio->op, tx_seq, expect_ack, false);
	/* C's lightweight CCA does not run the Rust perform_csma_ca() teardown.
	 * Reproduce its set_trx_off() explicitly so the RX gate cannot remain
	 * active while DMA3 is being handed to the LL TX state machine. */
	TLSR_REG8(0x0f16) = 0x29u;
	TLSR_REG8(0x0428) = RF_TRX_MODE;
	TLSR_REG8(0x0f02) = RF_TRX_OFF;

	/* Match zigbee-rs send_mac_frame(): prepare RX DMA before changing the
	 * LL to TX, then clear only the TX/DMA3 latches owned by this operation. */
	radio->rx_active[0] = 0u;
	radio->rx_active[4] = 0u;
	radio->rx_proc = radio->rx_active;
	tlsr8258_rf_rx_buffer_set(radio->rx_active, TLSR8258_RX_DMA_SIZE);
	TLSR_REG8(0x0c0e) = (uint8_t)(TLSR8258_RX_DMA_SIZE >> 4);
	TLSR_REG8(0x0c0f) = 0u;
	TLSR_REG16(0x0f20) = RF_IRQ_TX | RF_IRQ_TX_DS;
	TLSR_REG8(0x0c26) = DMA_CHN_RF_TX;
	TLSR_REG8(0x0f02) = RF_TRX_OFF | BIT(4);
	/* PHY settle delay used by the updated zigbee-rs TLSR8258 path. */
	k_busy_wait(250);
	tlsr8258_rf_tx_pkt(radio->tx_buffer);

	while (waited_us < TLSR8258_SYNC_POLL_TX_DONE_TIMEOUT_US) {
		if ((TLSR_REG16(0x0f20) & (RF_IRQ_TX | RF_IRQ_TX_DS)) != 0u) {
			tx_done = true;
			break;
		}
		k_busy_wait(TLSR8258_SYNC_POLL_TX_DONE_STEP_US);
		waited_us += TLSR8258_SYNC_POLL_TX_DONE_STEP_US;
	}
	/* Match zigbee-rs tx_done_clear(): clear RF TX and DMA3 completion before
	 * exposing the already-armed DMA2 buffer to the RX state machine. */
	TLSR_REG16(0x0f20) = RF_IRQ_TX | RF_IRQ_TX_DS;
	TLSR_REG8(0x0c26) = DMA_CHN_RF_TX;

	/* Re-arm DMA2 after TX-done, even though it was prepared before TX. On
	 * TLSR8258 the coordinator's MAC ACK can complete DMA2 during the TX/RX
	 * handoff and leave the channel's completion latch set; merely switching
	 * the LL back to RX then misses the indirect AssocResp a few milliseconds
	 * later. Re-point/re-arm first, then use the reset-free RX mode switch.
	 * Avoid RF_TRX_OFF here: it reopens the deaf window after an idle poll. */
	radio->rx_active[0] = 0u;
	radio->rx_active[4] = 0u;
	radio->rx_proc = radio->rx_active;
	tlsr8258_rf_rx_buffer_set(radio->rx_active, TLSR8258_RX_DMA_SIZE);
	tlsr8258_rf_set_rxmode_vendor();

	if (tx_done) {
		(void)tlsr8258_radio_op_on_tx_success(&radio->op);
	} else {
		tlsr8258_radio_op_on_timeout(&radio->op);
	}
	TLSR_REG16(0x0f20) = RF_IRQ_ALL;
	/* The sync poll owns the TX->RX handoff; restore the CPU RF source
	 * explicitly before the coordinator's indirect AssocResp arrives. */
	tlsr8258_rf_irq_reenable();
	return tlsr8258_radio_op_result_errno(&radio->op);
}

static int tlsr8258_tx(const struct device *dev, enum ieee802154_tx_mode mode,
		       struct net_pkt *pkt, struct net_buf *frag)
{
	struct tlsr8258_radio_data *radio = dev->data;
	uint8_t tx_seq = (frag != NULL && frag->len >= 3u) ? frag->data[2] : 0xffu;
	bool expect_ack;
	bool expect_post_tx_rx;
	bool expect_post_tx_followup;
	uint32_t wait_budget_us;
	uint16_t saved_irq_mask;
	uint16_t session_irq_mask;
	int ret;

