devbis/zephyr-tlsr8258/drivers/ieee802154/ieee802154_tlsr8258.c
	ARG_UNUSED(pkt);

	if (!tlsr8258_radio_started_get(radio)) {
		return -ENETDOWN;
	}

	if (mode != IEEE802154_TX_MODE_DIRECT && mode != IEEE802154_TX_MODE_CCA) {
		return -ENOTSUP;
	}

	if (mode == IEEE802154_TX_MODE_CCA) {
		ret = tlsr8258_cca(dev);
		if (ret < 0) {
			return ret;
		}
	}

	ret = tlsr8258_set_tx_payload(radio, frag->data, frag->len);
	if (ret < 0) {
		return ret;
	}

	expect_ack = tlsr8258_ack_requested(frag->data, frag->len);
	expect_post_tx_followup =
		tlsr8258_core_psdu_expects_post_tx_followup(frag->data, frag->len);
	/*
	 * Frames that need an immediate RX follow-up use a bounded hardware poll
	 * and deterministic RX turnaround. The async completion path can wait
	 * indefinitely when the RF TX-done interrupt remains latched.
	 */
	if (expect_post_tx_followup) {
		return tlsr8258_tx_sync_followup(radio, tx_seq, expect_ack);
	}

	/*
	 * A software MAC-ACK is kicked from the RX ISR and owns the RF TX state
	 * until its TX-done interrupt returns the chip to RX.  Do not reset the
	 * shared radio-op for a stack TX in that interval: doing so lets the ACK's
	 * completion wake the new operation before its own DMA transfer, which
	 * presents as a successful API call with no frame on air.
	 */
	for (uint32_t wait_us = 0u;
	     tlsr8258_ack_tx_pending_get(radio) && wait_us < 2000u;
	     wait_us += 50u) {
		k_busy_wait(50u);
	}
	if (tlsr8258_ack_tx_pending_get(radio)) {
		/* Lost ACK-TX completion: restore the always-RX invariant, then let the
		 * upper MAC retry this stack frame instead of corrupting the handoff. */
		tlsr8258_rf_rearm_idle_rx(radio);
		radio->op.ack_tx_pending = false;
		return -EAGAIN;
	}
	/*
	 * Under the Zigbee async RX sink, keep tx() short and let the upper
	 * layer consume Data Request follow-up traffic asynchronously.
	 */
	expect_post_tx_rx = (tlsr8258_zigbee_rx_sink == NULL) && expect_post_tx_followup;
	wait_budget_us = expect_post_tx_rx ? 150000u : CONFIG_IEEE802154_TLSR8258_TX_WAIT_US;
	k_timeout_t wait_timeout = K_USEC(wait_budget_us);
	saved_irq_mask = TLSR_REG16(0x0f1c);
	session_irq_mask =
		tlsr8258_tx_irq_session_mask(saved_irq_mask, expect_post_tx_followup);

	irq_disable(TLSR8258_IRQ_ZB_RT);
	k_sem_reset(&radio->tx_wait);
	tlsr8258_radio_op_prepare_tx(&radio->op, tx_seq, expect_ack, expect_post_tx_rx);
	tlsr8258_rf_prepare_normal_tx();
	tlsr8258_rf_set_txmode(radio);
	/* Rust keeps the TX DMA state stable for ~250 us after the mode switch
	 * before asserting the DMA-ready bit. */
	k_busy_wait(250);
	if (session_irq_mask != saved_irq_mask) {
		TLSR_REG16(0x0f1c) = 0u;
		TLSR_REG16(0x0f1c) = session_irq_mask;
	}
	if (tlsr8258_tx_force_manual_off_before_start(expect_post_tx_followup)) {
		TLSR_REG8(0x0f00) = 0x80u;
	}
	TLSR_REG16(0x0f20) = tlsr8258_tx_irq_start_clear_mask(expect_post_tx_followup);
	tlsr8258_tx_diag_put(radio, (0x10u << 24) | ((uint32_t)tx_seq << 16) | (uint32_t)mode);
	tlsr8258_rf_tx_pkt(radio->tx_buffer);
	/* irq_enable() updates only REG_IRQ_MASK; restore the global gate too. */
	tlsr8258_rf_irq_reenable();

	ret = k_sem_take(&radio->tx_wait, wait_timeout);
	if (session_irq_mask != saved_irq_mask) {
		TLSR_REG16(0x0f1c) = 0u;
		TLSR_REG16(0x0f1c) = saved_irq_mask;
	}
	if (ret == -EAGAIN) {
		uint16_t pending_irq = TLSR_REG16(0x0f20);

		/*
		 * On this silicon, TX completions for DataReq (and other short
		 * ACK-only round-trips) regularly miss the RF ISR — neither
		 * RF_IRQ_TX/TX_DS nor RF_IRQ_STX_TIMEOUT/FSM_TIMEOUT fire while
		 * the ISR is running, but the chip's IRQ status register at
		 * 0x0f20 holds the bit by the time tx() polls after the
		 * k_sem_take timeout.  Snapshot 0x0f20 BEFORE clearing it: if
		 * TX_DS or TX is asserted, the transmission did complete and
		 * the upper layer should not treat this as a failure.  Without
		 * this fallback every DataReq poll returns -EAGAIN even though
		 * the sniffer captures the frame and the coord's response.
		 *
		 * If the first read doesn't show the bit, give the chip a brief
		 * additional polling window (up to ~5 ms in 200 us steps) before
		 * triggering the destructive RF reset. Under channel contention
		 * the bit can latch slightly after our 10 ms semaphore expiry;
		 * catching those late assertions here avoids the rf_off bounce
		 * that itself costs further latency on the next TX.
		 */
		if ((pending_irq & (RF_IRQ_TX | RF_IRQ_TX_DS | RF_IRQ_STX_TIMEOUT |
				    RF_IRQ_FSM_TIMEOUT)) == 0u) {
			uint32_t extra_us;

			for (extra_us = 0u; extra_us < 5000u; extra_us += 200u) {
				k_busy_wait(200);
				pending_irq = TLSR_REG16(0x0f20);
				if ((pending_irq & (RF_IRQ_TX | RF_IRQ_TX_DS |
						    RF_IRQ_STX_TIMEOUT |
						    RF_IRQ_FSM_TIMEOUT)) != 0u) {
					break;
				}
			}
		}

		if ((pending_irq & (RF_IRQ_TX | RF_IRQ_TX_DS)) != 0u) {
			tlsr8258_tx_diag_put(radio, (0x16u << 24) |
						 ((uint32_t)tx_seq << 16) |
						 pending_irq);
			if (radio->op.expect_post_tx_rx) {
				tlsr8258_radio_op_on_timeout(&radio->op);
			} else {
				(void)tlsr8258_radio_op_on_tx_success(&radio->op);
			}
			/*
			 * This poll completed OUTSIDE the RF ISR (TX_DS masked for
			 * the session), so the ISR double-buffer swap never ran. If
			 * this was an ACK-requested poll expecting an indirect
			 * follow-up, the HW auto-received the coordinator's ACK into
			 * rx_active, leaving it occupied; re-arm a clean RX DMA
			 * buffer here so the ASSOCIATION-RESPONSE can land and raise
			 * an RX IRQ. Without this the join stalls with no post-poll
			 * raw RX of any class (see ieee802154_tlsr8258_tx_irq.c).
			 */
			if (tlsr8258_tx_poll_needs_rx_rearm(expect_post_tx_followup,
							    false)) {
				radio->rx_active[0] = 0u;
				radio->rx_active[4] = 0u;
				tlsr8258_rf_rx_buffer_set(radio->rx_active,
							  TLSR8258_RX_DMA_SIZE);
			}
			/* Reference order: DMA first, then reset-free RX mode. */
			tlsr8258_rf_set_rxmode_vendor();
			TLSR_REG16(0x0f20) = RF_IRQ_ALL;
			return tlsr8258_radio_op_result_errno(&radio->op);
		}

		if ((pending_irq & (RF_IRQ_STX_TIMEOUT | RF_IRQ_FSM_TIMEOUT)) != 0u) {
			/*
			 * Chip reported a hardware TX timeout explicitly. This
			 * is a soft failure — the RF state machine is still
			 * coherent — so skip the rf_off bounce and just restore
			 * RX mode. Upper layer gets -EIO to retry.
			 */
			tlsr8258_tx_diag_put(radio, (0x17u << 24) |
						 ((uint32_t)tx_seq << 16) |
						 pending_irq);
			tlsr8258_radio_op_on_tx_error(&radio->op, -EIO);
			tlsr8258_rf_rearm_idle_rx(radio);
			return tlsr8258_radio_op_result_errno(&radio->op);
		}

