devbis/zephyr-tlsr8258/drivers/ieee802154/ieee802154_tlsr8258.c
		tlsr8258_tx_diag_put(radio, (0x15u << 24) | ((uint32_t)tx_seq << 16) |
					 wait_budget_us);
		tlsr8258_radio_op_on_timeout(&radio->op);

		/*
		 * Aggressive RF recovery: on this silicon, a tx_wait timeout
		 * with neither the TX nor TIMEOUT IRQ bits set in 0x0f20 means
		 * the RF state machine is wedged in an intermediate state.
		 * Just calling tlsr8258_rf_set_rxmode() leaves the chip with
		 * lingering TX-side configuration that prevents subsequent TXes
		 * from ever generating a TX-done event (observed: 5 of 46 TXes
		 * succeed, the rest pile up timeouts and eventually the chip
		 * stops responding to SWS entirely).  Bounce the RF off then
		 * back into RX mode to force the state machine to a clean RX
		 * idle from any stuck TX-side state.
		 */
		tlsr8258_rf_off();
		k_busy_wait(50);
		tlsr8258_rf_rearm_idle_rx(radio);
		return tlsr8258_radio_op_result_errno(&radio->op);
	}

	TLSR_REG16(0x0f20) = RF_IRQ_ALL;
	return tlsr8258_radio_op_result_errno(&radio->op);
}

static int tlsr8258_ed_scan(const struct device *dev, uint16_t duration,
			    energy_scan_done_cb_t done_cb)
{
	ARG_UNUSED(dev);
	ARG_UNUSED(duration);
	ARG_UNUSED(done_cb);

	return -ENOTSUP;
}

static int tlsr8258_configure(const struct device *dev, enum ieee802154_config_type type,
			      const struct ieee802154_config *config)
{
	struct tlsr8258_radio_data *radio = dev->data;

	if (type == IEEE802154_CONFIG_PROMISCUOUS) {
		tlsr8258_radio_promiscuous_set(radio, config->promiscuous);
		return 0;
	}

	return -ENOTSUP;
}

IEEE802154_DEFINE_PHY_SUPPORTED_CHANNELS(tlsr8258_attr, 11, 26);

static int tlsr8258_attr_get(const struct device *dev, enum ieee802154_attr attr,
			     struct ieee802154_attr_value *value)
{
	ARG_UNUSED(dev);

	return ieee802154_attr_get_channel_page_and_range(
		attr, IEEE802154_ATTR_PHY_CHANNEL_PAGE_ZERO_OQPSK_2450_BPSK_868_915,
		&tlsr8258_attr.phy_supported_channels, value);
}

static const struct ieee802154_radio_api tlsr8258_radio_api = {
	.iface_api.init = tlsr8258_iface_init,
	.get_capabilities = tlsr8258_get_capabilities,
	.cca = tlsr8258_cca,
	.set_channel = tlsr8258_set_channel,
	.filter = tlsr8258_filter,
	.set_txpower = tlsr8258_set_txpower,
	.start = tlsr8258_start,
	.stop = tlsr8258_stop,
	.tx = tlsr8258_tx,
	.ed_scan = tlsr8258_ed_scan,
	.configure = tlsr8258_configure,
	.attr_get = tlsr8258_attr_get,
};

static void tlsr8258_irq_config(const struct device *dev)
{
	/*
	 * rf_irq_reenable() enables both the RF ZB_RT source (IRQ 13) and
	 * the RF DMA completion source (IRQ 4).  IRQ 4 must have a real
	 * vector: leaving it at Zephyr's default z_irq_spurious handler makes
	 * a normal RX/TX DMA completion fatal under interview traffic.
	 * The RF ISR clears both latched sources, so use the same handler for
	 * the two hardware sources.  The TC32 IRQ dispatcher services IRQ 13
	 * first when both are pending and will enter here again for IRQ 4 if
	 * the DMA latch remains set.
	 */
	IRQ_CONNECT(TLSR8258_IRQ_DMA, 0, tlsr8258_rf_isr, &tlsr8258_radio_data_0, 0);
	IRQ_CONNECT(DT_INST_IRQN(0), 0, tlsr8258_rf_isr, &tlsr8258_radio_data_0, 0);
	irq_disable(TLSR8258_IRQ_DMA);
	irq_disable(TLSR8258_IRQ_ZB_RT);
	ARG_UNUSED(dev);
}

/* Set true once tlsr8258_init() has run rx_queue_init; gates the zb_thread
 * RX-poll drain so it never touches an uninitialized k_fifo. */
static bool tlsr8258_hw_inited;

/*
 * Override the weak zb_main.c hook. The ZB thread busy-loop calls this every
 * tick; it is the sole RX consumer (there is no separate COOP RX worker
 * thread — see tlsr8258_init). Draining from the always-runnable ZB thread makes RX delivery
 * independent of cooperative-thread scheduling.
 */
void zb_platform_radio_rx_poll(void)
{
	if (tlsr8258_hw_inited) {
		tlsr8258_rx_drain_pending(&tlsr8258_radio_data_0);
	}
}

static const struct tlsr8258_radio_config tlsr8258_radio_config_0 = {
	.irq_config_func = tlsr8258_irq_config,
};

static int tlsr8258_init(const struct device *dev)
{
	const struct tlsr8258_radio_config *config = dev->config;
	struct tlsr8258_radio_data *radio = dev->data;
	/*
	 * Guard against double-invocation.  The Zephyr kernel calls this via
	 * do_device_init() at POST_KERNEL level, but on TLSR8258 the .data
	 * section copy from flash LMA > boot-mirror window may fail, leaving
	 * device_state.init_res stale.  zb_radio_port_tlsr8258_get() works
	 * around that by calling device_init() as a fallback; the flag below
	 * prevents the k_thread_create path from running twice.
	 */
	if (tlsr8258_hw_inited) {
		return 0;
	}

	memset(radio, 0, sizeof(*radio));
#if defined(CONFIG_IEEE802154_TLSR8258_RETAINED_DEBUG)
	radio->debug = &tlsr8258_radio_debug_state;
#endif
	tlsr8258_rf_debug_reset(radio);
	memcpy(radio->filter_pan_id, tlsr8258_filter_pan_id_shadow,
	       TLSR8258_PAN_ID_SIZE);
	memcpy(radio->filter_short_addr, tlsr8258_filter_short_addr_shadow,
	       TLSR8258_SHORT_ADDR_SIZE);
	memcpy(radio->filter_ieee_addr, tlsr8258_filter_ieee_addr_shadow,
	       TLSR8258_IEEE_ADDR_SIZE);
	tlsr8258_radio_current_channel_set(radio, tlsr8258_channel_shadow);

	tlsr8258_rx_queue_init(&radio->rx_queue, radio->rx_slots, TLSR8258_RX_SLOT_COUNT);
	k_sem_init(&radio->tx_wait, 0, 1);

	/*
	 * RX is drained from the ZB thread via zb_platform_radio_rx_poll (single
	 * consumer, no zb_buf race, no cooperative-starvation) — there is no
	 * separate RX worker thread.
	 */
	config->irq_config_func(dev);
	tlsr8258_hw_inited = true;

	return 0;
}

#if defined(CONFIG_IEEE802154_RAW_MODE)
DEVICE_DT_INST_DEFINE(0, tlsr8258_init, NULL, &tlsr8258_radio_data_0, &tlsr8258_radio_config_0,
		      POST_KERNEL, CONFIG_IEEE802154_TLSR8258_INIT_PRIO,
		      &tlsr8258_radio_api);
#elif defined(CONFIG_NET_L2_IEEE802154)
NET_DEVICE_DT_INST_DEFINE(0, tlsr8258_init, NULL, &tlsr8258_radio_data_0,
			  &tlsr8258_radio_config_0,
			  CONFIG_IEEE802154_TLSR8258_INIT_PRIO,
			  &tlsr8258_radio_api, IEEE802154_L2,
			  NET_L2_GET_CTX_TYPE(IEEE802154_L2),
			  TLSR8258_PHY_MAX_PSDU - TLSR8258_FCS_LENGTH);
#elif defined(CONFIG_NET_L2_OPENTHREAD)
NET_DEVICE_DT_INST_DEFINE(0, tlsr8258_init, NULL, &tlsr8258_radio_data_0,
			  &tlsr8258_radio_config_0,
			  CONFIG_IEEE802154_TLSR8258_INIT_PRIO,
			  &tlsr8258_radio_api, OPENTHREAD_L2,
			  NET_L2_GET_CTX_TYPE(OPENTHREAD_L2), 1280);
#elif defined(CONFIG_NET_L2_CUSTOM_IEEE802154)
NET_DEVICE_DT_INST_DEFINE(0, tlsr8258_init, NULL, &tlsr8258_radio_data_0,
			  &tlsr8258_radio_config_0,
			  CONFIG_IEEE802154_TLSR8258_INIT_PRIO,
			  &tlsr8258_radio_api, CUSTOM_IEEE802154_L2,
			  NET_L2_GET_CTX_TYPE(CUSTOM_IEEE802154_L2),
			  TLSR8258_PHY_MAX_PSDU - TLSR8258_FCS_LENGTH);
#endif
